{"vllm":0,"code":1,"conduct":2,"our":3,"pledge":4,"we":5,"members":6,"contributors":7,"leaders":8,"make":9,"participation":10,"community":11,"harassment":12,"free":13,"experience":14,"everyone":15,"regardless":16,"age":17,"body":18,"size":19,"visible":20,"invisible":21,"disability":22,"ethnicity":23,"sex":24,"characteristics":25,"gender":26,"identity":27,"expression":28,"level":29,"education":30,"socioeconomic":31,"status":32,"nationality":33,"personal":34,"appearance":35,"race":36,"caste":37,"color":38,"religion":39,"sexual":40,"orientation":41,"act":42,"interact":43,"ways":44,"contribute":45,"open":46,"welcoming":47,"diverse":48,"inclusive":49,"healthy":50,"standards":51,"examples":52,"behavior":53,"contributes":54,"positive":55,"environment":56,"include":57,"demonstrating":58,"empathy":59,"kindness":60,"toward":61,"other":62,"people":63,"being":64,"respectful":65,"differing":66,"opinions":67,"viewpoints":68,"experiences":69,"giving":70,"gracefully":71,"accepting":72,"constructive":73,"feedback":74,"responsibility":75,"apologizing":76,"those":77,"affected":78,"mistakes":79,"learning":80,"from":81,"focusing":82,"what":83,"best":84,"just":85,"us":86,"individuals":87,"overall":88,"unacceptable":89,"use":90,"sexualized":91,"language":92,"imagery":93,"attention":94,"advances":95,"any":96,"kind":97,"trolling":98,"insulting":99,"derogatory":100,"comments":101,"political":102,"attacks":103,"public":104,"private":105,"publishing":106,"others":107,"information":108,"physical":109,"email":110,"address":111,"without":112,"explicit":113,"permission":114,"which":115,"could":116,"reasonably":117,"considered":118,"inappropriate":119,"professional":120,"setting":121,"enforcement":122,"responsibilities":123,"responsible":124,"clarifying":125,"enforcing":126,"acceptable":127,"take":128,"appropriate":129,"fair":130,"corrective":131,"action":132,"response":133,"deem":134,"threatening":135,"offensive":136,"harmful":137,"have":138,"right":139,"remove":140,"edit":141,"reject":142,"commits":143,"wiki":144,"edits":145,"issues":146,"contributions":147,"aligned":148,"communicate":149,"reasons":150,"moderation":151,"decisions":152,"when":153,"scope":154,"applies":155,"within":156,"all":157,"spaces":158,"also":159,"individual":160,"officially":161,"representing":162,"using":163,"official":164,"posting":165,"via":166,"social":167,"media":168,"account":169,"acting":170,"appointed":171,"representative":172,"online":173,"offline":174,"irl":175,"event":176,"instances":177,"abusive":178,"harassing":179,"otherwise":180,"may":181,"reported":182,"channel":183,"slack":184,"https":185,"ai":186,"complaints":187,"reviewed":188,"investigated":189,"promptly":190,"fairly":191,"obligated":192,"respect":193,"privacy":194,"security":195,"reporter":196,"incident":197,"guidelines":198,"follow":199,"impact":200,"determining":201,"consequences":202,"violation":203,"correction":204,"deemed":205,"unprofessional":206,"unwelcome":207,"consequence":208,"written":209,"warning":210,"providing":211,"clarity":212,"around":213,"nature":214,"explanation":215,"why":216,"apology":217,"requested":218,"through":219,"single":220,"series":221,"actions":222,"continued":223,"interaction":224,"involved":225,"including":226,"unsolicited":227,"specified":228,"period":229,"time":230,"includes":231,"avoiding":232,"interactions":233,"well":234,"external":235,"channels":236,"like":237,"violating":238,"terms":239,"lead":240,"temporary":241,"permanent":242,"ban":243,"serious":244,"sustained":245,"sort":246,"communication":247,"allowed":248,"during":249,"pattern":250,"aggression":251,"disparagement":252,"classes":253,"attribution":254,"adapted":255,"contributor":256,"covenant":257,"www":258,"org":259,"version":260,"available":261,"v2":262,"code_of_conduct":263,"html":264,"were":265,"inspired":266,"mozilla":267,"ladder":268,"github":269,"com":270,"inclusion":271,"answers":272,"common":273,"questions":274,"about":275,"see":276,"faq":277,"translations":278,"releasing":279,"releases":280,"offer":281,"reliable":282,"base":283,"packaged":284,"binary":285,"format":286,"can":287,"conveniently":288,"accessed":289,"pypi":290,"serve":291,"key":292,"milestones":293,"development":294,"team":295,"newly":296,"features":297,"improvements":298,"upcoming":299,"changes":300,"affect":301,"users":302,"potential":303,"breaking":304,"release":305,"versioning":306,"uses":307,"shifted":308,"scheme":309,"where":310,"new":311,"patch":312,"out":313,"every":314,"weeks":315,"contain":316,"bug":317,"fixes":318,"opposed":319,"semver":320,"contains":321,"only":322,"backwards":323,"compatible":324,"critical":325,"need":326,"made":327,"special":328,"post1":329,"released":330,"_major_":331,"major":332,"architectural":333,"milestone":334,"incompatible":335,"api":336,"similar":337,"pytorch":338,"_minor_":339,"_patch_":340,"_post1_":341,"_patch":342,"1_":343,"either":344,"implicit":345,"post":346,"cadence":347,"bi":348,"weekly":349,"basis":350,"days":351,"after":352,"same":353,"branch":354,"following":355,"year":356,"2025":357,"future":358,"dates":359,"below":360,"tentative":361,"please":362,"note":363,"optional":364,"date":365,"versions":366,"jan":367,"feb":368,"mar":369,"apr":370,"jun":371,"10":372,"11":373,"jul":374,"12":375,"13":376,"aug":377,"14":378,"15":379,"sep":380,"16":381,"17":382,"oct":383,"18":384,"19":385,"nov":386,"20":387,"21":388,"dec":389,"22":390,"23":391,"each":392,"built":393,"dedicated":394,"cut":395,"performed":396,"before":397,"live":398,"previously":399,"reused":400,"builds":401,"triggered":402,"push":403,"rc":404,"tag":405,"vx":406,"rc1":407,"enables":408,"build":409,"test":410,"multiple":411,"rcs":412,"final":413,"does":414,"trigger":415,"used":416,"notes":417,"assets":418,"created":419,"monitor":420,"main":421,"reverts":422,"apply":423,"cherry":424,"pick":425,"criteria":426,"approach":427,"finalizing":428,"clear":429,"picks":430,"process":431,"land":432,"pr":433,"typically":434,"limited":435,"ensure":436,"has":437,"sufficient":438,"complete":439,"thorough":440,"round":441,"testing":442,"stable":443,"regression":444,"functional":445,"performance":446,"against":447,"most":448,"recent":449,"severe":450,"issue":451,"silent":452,"incorrectness":453,"compatibility":454,"crashes":455,"deadlocks":456,"large":457,"memory":458,"leaks":459,"introduced":460,"documentation":461,"specific":462,"change":463,"identifiers":464,"ci":465,"feature":466,"work":467,"prs":468,"merged":469,"trunk":470,"exception":471,"manual":472,"validations":473,"e2e":474,"validation":475,"perform":476,"end":477,"regressions":478,"benchmark":479,"workflow":480,"integration":481,"workflows":482,"yml":483,"current":484,"coverage":485,"models":486,"llama3":487,"llama4":488,"mixtral":489,"hardware":490,"nvidia":491,"h100":492,"amd":493,"mi300x":494,"_note":495,"based":496,"model":497,"availability_":498,"step":499,"get":500,"access":501,"request":502,"write":503,"repository":504,"run":505,"review":506,"setup":507,"familiarize":508,"yourself":509,"configurations":510,"cuda":511,"tree":512,"benchmarks":513,"rocm":514,"navigate":515,"configure":516,"set":517,"v0":518,"commit":519,"hash":520,"results":521,"once":522,"completes":523,"dashboard":524,"hud":525,"llms":526,"reponame":527,"project":528,"2fvllm":529,"under":530,"corresponding":531,"comparison":532,"compare":533,"previous":534,"verify":535,"occurred":536,"here":537,"example":538,"vs":539,"starttime":540,"thu":541,"2c":542,"2017":543,"20apr":544,"202025":545,"2021":546,"3a43":547,"3a50":548,"20gmt":549,"stoptime":550,"wed":551,"2016":552,"20jul":553,"granularity":554,"week":555,"lbranch":556,"lcommit":557,"b6553be1bc75f046b00046a4ad7576364d03c835":558,"rbranch":559,"re":560,"hu":561,"rcommit":562,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":563,"benchmarkname":564,"modelname":565,"20models":566,"backendname":567,"20backends":568,"modename":569,"20modes":570,"dtypename":571,"20dtype":572,"devicename":573,"20devices":574,"archname":575,"20platforms":576,"import":577,"glob":578,"requires_files":579,"requirements":580,"txt":581,"pyproject":582,"toml":583,"file":584,"print":585,"cleaning":586,"lines":587,"readlines":588,"torch":589,"join":590,"lower":591,"removed":592,"line":593,"else":594,"strip":595,"done":596,"policy":597,"reporting":598,"report":599,"privately":600,"vulnerability":601,"submission":602,"form":603,"advisories":604,"triage":605,"reports":606,"triaged":607,"management":608,"docs":609,"en":610,"latest":611,"contributing":612,"vulnerability_management":613,"threat":614,"guide":615,"usage":616,"more":617,"assumptions":618,"recommendations":619,"blob":620,"md":621,"how":622,"securely":623,"severity":624,"determine":625,"risk":626,"taking":627,"dealing":628,"past":629,"defaults":630,"cases":631,"categories":632,"vulnerabilities":633,"allow":634,"remote":635,"attackers":636,"execute":637,"arbitrary":638,"full":639,"control":640,"system":641,"significantly":642,"compromise":643,"confidentiality":644,"integrity":645,"availability":646,"privileges":647,"needed":648,"execution":649,"network":650,"deserialization":651,"exploit":652,"chains":653,"generally":654,"rated":655,"cvss":656,"high":657,"flaws":658,"elevated":659,"rce":660,"contexts":661,"significant":662,"data":663,"loss":664,"require":665,"advanced":666,"conditions":667,"some":668,"trust":669,"deployment":670,"modes":671,"multi":672,"node":673,"privileged":674,"required":675,"scores":676,"between":677,"moderate":678,"cause":679,"denial":680,"service":681,"partial":682,"disruption":683,"do":684,"breach":685,"rating":686,"low":687,"minor":688,"informational":689,"disclosures":690,"logging":691,"errors":692,"non":693,"exploitable":694,"weaknesses":695,"local":696,"privilege":697,"negligible":698,"side":699,"collisions":700,"often":701,"less":702,"than":703,"prenotification":704,"certain":705,"prenotify":706,"organizations":707,"vendors":708,"ship":709,"purpose":710,"coordinated":711,"notification":712,"adding":713,"contacts":714,"advisory":715,"few":716,"you":717,"wish":718,"added":719,"group":720,"send":721,"copying":722,"vendor":723,"contact":724,"analyzed":725,"case":726,"withdraw":727,"receiving":728,"prenotifications":729,"membership":730,"refinements":731,"who":732,"included":733,"class":734,"cmake_build_ext":735,"build_ext":736,"dict":737,"extension":738,"directories":739,"been":740,"configured":741,"did_config":742,"str":743,"bool":744,"number":745,"compilation":746,"jobs":747,"optionally":748,"nvcc":749,"compile":750,"threads":751,"def":752,"compute_num_jobs":753,"self":754,"num_jobs":755,"value":756,"max_jobs":757,"variable":758,"defined":759,"cpus":760,"envs":761,"none":762,"int":763,"logger":764,"info":765,"try":766,"os":767,"sched_getaffinity":768,"isn":769,"universally":770,"so":771,"fall":772,"back":773,"cpu_count":774,"error":775,"len":776,"except":777,"attributeerror":778,"nvcc_threads":779,"_is_cuda":780,"get_nvcc_cuda_version":781,"reduce":782,"avoid":783,"overloading":784,"max":785,"return":786,"cmake":787,"configuration":788,"ext":789,"cmakeextension":790,"ve":791,"already":792,"cmakelists":793,"exit":794,"early":795,"cmake_lists_dir":796,"true":797,"akelists":798,"select":799,"type":800,"optimization":801,"debug":802,"default_cfg":803,"relwithdebinfo":804,"cfg":805,"cmake_build_type":806,"cmake_args":807,"dcmake_build_type":808,"dvllm_target_device":809,"vllm_target_device":810,"verbose":811,"dcmake_verbose_makefile":812,"is_sccache_available":813,"dcmake_c_compiler_launcher":814,"sccache":815,"dcmake_cxx_compiler_launcher":816,"dcmake_cuda_compiler_launcher":817,"dcmake_hip_compiler_launcher":818,"elif":819,"is_ccache_available":820,"ccache":821,"pass":822,"python":823,"executable":824,"find":825,"exact":826,"match":827,"dvllm_python_executable":828,"sys":829,"path":830,"reuse":831,"dependencies":832,"subsequent":833,"calls":834,"dvllm_python_path":835,"override":836,"directory":837,"fetchcontent":838,"downloads":839,"root":840,"deps":841,"allows":842,"sharing":843,"profiles":844,"plays":845,"nicely":846,"fetchcontent_base_dir":847,"fc_base_dir":848,"root_dir":849,"environ":850,"dfetchcontent_base_dir":851,"parallelism":852,"tool":853,"dnvcc_threads":854,"is_ninja_available":855,"build_tool":856,"ninja":857,"dcmake_job_pool_compile":858,"string":859,"dcmake_job_pools":860,"default":861,"whatever":862,"sure":863,"cuda_home":864,"dcmake_cuda_compiler":865,"bin":866,"subprocess":867,"check_call":868,"cwd":869,"build_temp":870,"build_extensions":871,"present":872,"working":873,"check_output":874,"oserror":875,"raise":876,"runtimeerror":877,"cannot":878,"create":879,"exist":880,"exists":881,"makedirs":882,"targets":883,"target_name":884,"removeprefix":885,"vllm_flash_attn":886,"extensions":887,"append":888,"name":889,"build_args":890,"nu":891,"elf":892,"target":893,"install":894,"libraries":895,"proper":896,"location":897,"outdir":898,"get_ext_fullpath":899,"parent":900,"absolute":901,"skip":902,"continue":903,"appends":904,"prefix":905,"range":906,"count":907,"should":908,"actually":909,"components":910,"install_args":911,"component":912,"first":913,"standard":914,"command":915,"super":916,"copy":917,"py":918,"build_lib":919,"editable":920,"files":921,"recursive":922,"dst_file":923,"split":924,"dirname":925,"dst_fi":926,"exist_ok":927,"copy_file":928,"precompiled_wheel_utils":929,"extracts":930,"existing":931,"wheel":932,"staticmethod":933,"extract_precompiled_and_patch_package":934,"wheel_url_or_path":935,"tempfile":936,"zipfile":937,"temp_dir":938,"isfile":939,"wheel_filename":940,"mkdtemp":941,"wheels":942,"wheel_path":943,"downloading":944,"urllib":945,"urlretrieve":946,"filename":947,"package_data_patch":948,"files_to_copy":949,"_c":950,"abi3":951,"_moe_c":952,"_flashmla_c":953,"_vllm_fa2_c":954,"_vllm_fa3_c":955,"cumem_allocator":956,"compiled_regex":957,"file_members":958,"list":959,"filter":960,"lambda":961,"filelist":962,"extract":963,"target_path":964,"target_pa":965,"le":966,"src":967,"wb":968,"dst":969,"shutil":970,"copyfileobj":971,"pkg":972,"replace":973,"setdefault":974,"basename":975,"finally":976,"removing":977,"rmtree":978,"get_base_commit_in_main_branch":979,"force":980,"nightly":981,"mainly":982,"vllm_test_use_precompiled_nightly_wheel":983,"upstream":984,"resp_json":985,"curl":986,"repos":987,"decode":988,"utf":989,"upstream_main_commit":990,"json":991,"loads":992,"sha":993,"docker":994,"context":995,"git":996,"immutable":997,"missing":998,"vllm_docker_build_context":999,"check":1000,"repo":1001,"cat":1002,"calledprocesserror":1003,"fetch":1004,"update":1005,"branches":1006,"ensures":1007,"ref":1008,"its":1009,"history":1010,"current_branch":1011,"show":1012,"base_commit":1013,"merge":1014,"valueerror":1015,"err":1016,"failed":1017,"your":1018,"dev":1019,"ctypes":1020,"importlib":1021,"util":1022,"pathlib":1023,"packaging":1024,"parse":1025,"setuptools":1026,"setuptools_scm":1027,"get_version":1028,"utils":1029,"cpp_extension":1030,"rocm_home":1031,"load_module_from_path":1032,"module_name":1033,"spec":1034,"spec_from_file_location":1035,"module":1036,"module_from_spec":1037,"modules":1038,"loader":1039,"exec_module":1040,"__file__":1041,"getlogger":1042,"__name__":1043,"directly":1044,"because":1045,"depends":1046,"installed":1047,"yet":1048,"platform":1049,"startswith":1050,"darwin":1051,"cpu":1052,"automatically":1053,"due":1054,"macos":1055,"linux":1056,"supports":1057,"wsl":1058,"building":1059,"able":1060,"correctly":1061,"empty":1062,"getenv":1063,"hip":1064,"fallback":1065,"main_cuda_version":1066,"vllm_disable_sccache":1067,"is_url_available":1068,"url":1069,"urlopen":1070,"false":1071,"200":1072,"__init__":1073,"kwa":1074,"sources":1075,"py_limited_api":1076,"abspath":1077,"precompiled_build_ext":1078,"disables":1079,"precompiled":1080,"binaries":1081,"assert":1082,"vllm_use_precompiled":1083,"supported":1084,"skipping":1085,"_no_device":1086,"has_cuda":1087,"_is_neuron":1088,"_is_tpu":1089,"_is_hip":1090,"neuron":1091,"tpu":1092,"_is_cpu":1093,"_is_xpu":1094,"xpu":1095,"_build_custom_ops":1096,"get_rocm_version":1097,"librocm":1098,"core":1099,"d11f5c20d500f729c393680a01fa902ebf92094b":1100,"rocm_version":1101,"cpp":1102,"l21":1103,"librocm_core_file":1104,"lib":1105,"is_file":1106,"librocm_core":1107,"cdll":1108,"vererrors":1109,"c_uint32":1110,"get_rocm_core_version":1111,"getrocmversion":1112,"restype":1113,"argtypes":1114,"pointer":1115,"byref":1116,"get_neuronxcc_version":1117,"sysconfig":1118,"site_dir":1119,"get_paths":1120,"purelib":1121,"version_file":1122,"neuronxcc":1123,"executed":1124,"successfully":1125,"fp":1126,"content":1127,"read":1128,"regular":1129,"search":1130,"__version__":1131,"output":1132,"apex":1133,"8b7a1ff183741dd8f9b87e7bafd04cfde99cea28":1134,"nvcc_output":1135,"universal_newlines":1136,"release_idx":1137,"index":1138,"nvcc_cuda_version":1139,"get_gaudi_sw_version":1140,"returns":1141,"driver":1142,"enable":1143,"console":1144,"printing":1145,"hl":1146,"smi":1147,"shell":1148,"text":1149,"capture_output":1150,"env":1151,"enable_console":1152,"returncode":1153,"stdout":1154,"get_vllm_version":1155,"write_to":1156,"_version":1157,"might":1158,"cuda_version":1159,"cuda_version_str":1160,"source":1161,"tarball":1162,"sdist":1163,"argv":1164,"cu":1165,"neuron_version":1166,"neuron_version_str":1167,"unknown":1168,"runtime":1169,"get_requirements":1170,"package":1171,"requirements_dir":1172,"_read_requirements":1173,"resolved_requirements":1174,"cuda_major":1175,"cuda_minor":1176,"modified_requirements":1177,"req":1178,"flash":1179,"attn":1180,"unsupported":1181,"ext_modules":1182,"_rocm_c":1183,"fa3":1184,"requires":1185,"later":1186,"since":1187,"doesn":1188,"produce":1189,"targeting":1190,"hopper":1191,"package_data":1192,"typed":1193,"model_executor":1194,"layers":1195,"fused_moe":1196,"configs":1197,"quantization":1198,"wheel_location":1199,"vllm_precompiled_wheel_location":1200,"wheel_url":1201,"cp38":1202,"manylinux1_x86_64":1203,"whl":1204,"resp":1205,"warn":1206,"falling":1207,"items":1208,"extend":1209,"cmdclass":1210,"static":1211,"metadata":1212,"rather":1213,"go":1214,"install_requires":1215,"extras_require":1216,"bench":1217,"pandas":1218,"datasets":1219,"tensorizer":1220,"fastsafetensors":1221,"runai":1222,"streamer":1223,"s3":1224,"boto3":1225,"audio":1226,"librosa":1227,"soundfile":1228,"mistral_common":1229,"processing":1230,"video":1231,"kept":1232,"flashinfer":1233,"updated":1234,"together":1235,"dockerfile":1236,"cmake_minimum_required":1237,"26":1238,"places":1239,"correct":1240,"mkdir":1241,"cd":1242,"python3":1243,"dcmake_install_prefix":1244,"want":1245,"one":1246,"manually":1247,"vllm_extensions":1248,"languages":1249,"cxx":1250,"overridden":1251,"cache":1252,"device":1253,"backend":1254,"message":1255,"cmake_current_list_dir":1256,"suppress":1257,"warnings":1258,"unused":1259,"variables":1260,"ignoreme":1261,"vllm_python_path":1262,"prevent":1263,"installation":1264,"cutlass":1265,"cmake_install_local_only":1266,"all_components":1267,"searched":1268,"order":1269,"selected":1270,"sync":1271,"python_supported_versions":1272,"gpu":1273,"architectures":1274,"hip_supported_archs":1275,"gfx906":1276,"gfx908":1277,"gfx90a":1278,"gfx942":1279,"gfx950":1280,"gfx1030":1281,"gfx1100":1282,"gfx1101":1283,"gfx1200":1284,"gfx1201":1285,"expected":1286,"currently":1287,"having":1288,"incorrect":1289,"derived":1290,"various":1291,"consistent":1292,"torch_supported_version_cuda":1293,"torch_supported_version_rocm":1294,"exactly":1295,"matches":1296,"vllm_python_executable":1297,"n_cuda":1298,"find_python_from_executable":1299,"fatal_error":1300,"desired":1301,"running":1302,"endif":1303,"cmake_prefix_path":1304,"append_cmake_prefix_path":1305,"find_program":1306,"nvcc_executable":1307,"cuda_found":1308,"found":1309,"imports":1310,"partially":1311,"customizations":1312,"explicitly":1313,"check_language":1314,"enable_language":1315,"etc":1316,"find_package":1317,"must":1318,"happen":1319,"cmake_cuda_compiler_version":1320,"gets":1321,"version_greater_equal":1322,"cuda_supported_archs":1323,"forward":1324,"scripts":1325,"strequal":1326,"cpu_extension":1327,"up":1328,"hip_found":1329,"vllm_gpu_lang":1330,"torch_version":1331,"version_equal":1332,"saw":1333,"instead":1334,"elseif":1335,"importing":1336,"recognizes":1337,"sets":1338,"let":1339,"recognize":1340,"understand":1341,"enabled":1342,"rocm_version_dev_major":1343,"greater_equal":1344,"per":1345,"down":1346,"cmake_cuda_flags":1347,"applied":1348,"globally":1349,"clear_cuda_arches":1350,"cuda_arch_flags":1351,"extract_unique_cuda_archs_ascending":1352,"cuda_archs":1353,"archs":1354,"cuda_archs_loose_intersection":1355,"detected":1356,"them":1357,"arches":1358,"stored":1359,"vllm_gpu_a":1360,"vllm_gpu_arches":1361,"override_gpu_arches":1362,"_supported_archs":1363,"query":1364,"additional":1365,"flags":1366,"given":1367,"vllm_gpu_flags":1368,"get_torch_gpu_compiler_flags":1369,"compiled":1370,"part":1371,"play":1372,"dependency":1373,"produces":1374,"artifacts":1375,"binary_dir":1376,"conflicts":1377,"types":1378,"cmake_binary_dir":1379,"make_directory":1380,"overriding":1381,"ggdb3":1382,"devug":1383,"cmake_":1384,"_flags_debug":1385,"o0":1386,"cmake_cxx_flags_debug":1387,"functions":1388,"marked":1389,"nodiscard":1390,"ignores":1391,"result":1392,"generates":1393,"lot":1394,"always":1395,"mask":1396,"real":1397,"suppressing":1398,"until":1399,"properly":1400,"addressed":1401,"_flags":1402,"wno":1403,"cmake_cxx_flags":1404,"define":1405,"vllm_cumem_ext_src":1406,"csrc":1407,"set_gencode_f":1408,"e_cxx_flags":1409,"set_gencode_flags_for_srcs":1410,"srcs":1411,"enabling":1412,"cumem":1413,"allocator":1414,"link":1415,"library":1416,"cumem_libs":1417,"cuda_driver":1418,"define_gpu_extension_target":1419,"destination":1420,"use_sabi":1421,"with_soabi":1422,"vllm_ext_src":1423,"mamba":1424,"mamba_ssm":1425,"selective_scan_fwd":1426,"cache_kernels":1427,"paged_attention_v1":1428,"paged_attention_v2":1429,"merge_attn_states":1430,"vertical_slash_index":1431,"pos_encoding_kernels":1432,"activation_kernels":1433,"layernorm_kernels":1434,"layernorm_quant_kernels":1435,"sampler":1436,"cuda_view":1437,"gptq":1438,"q_gemm":1439,"compressed_tensors":1440,"int8_quant_kernels":1441,"fp8":1442,"fused_kernels":1443,"fused_layernorm_dynamic_per_token_quant":1444,"gguf":1445,"gguf_kernel":1446,"cuda_utils_kernels":1447,"custom_all_reduce":1448,"torch_bindings":1449,"cutlass_enable_headers_only":1450,"header":1451,"cutlass_revision":1452,"bogus":1453,"messages":1454,"v4":1455,"revision":1456,"vllm_cutlass_src_dir":1457,"provided":1458,"is_absolute":1459,"get_filename_component":1460,"fetchcontent_declare":1461,"source_dir":1462,"git_repository":1463,"keep":1464,"above":1465,"git_tag":1466,"git_progress":1467,"speed":1468,"download":1469,"retrieving":1470,"important":1471,"git_shallow":1472,"works":1473,"names":1474,"tags":1475,"fetchcontent_makeavailable":1476,"awq":1477,"gemm_kernels":1478,"permute_cols":1479,"cutlass_w8a8":1480,"scaled_mm_entry":1481,"fp4":1482,"nvfp4_quant_entry":1483,"nvfp4_scaled_mm_entry":1484,"nvfp4_blockwise_moe_kernel":1485,"sparse":1486,"sparse_scaled_mm_entry":1487,"cutlass_extensions":1488,"mla":1489,"cutlass_mla_entry":1490,"per_token_group_quant":1491,"marlin":1492,"kernels":1493,"least":1494,"sizes":1495,"shapes":1496,"machete":1497,"bf16":1498,"atomicadd":1499,"ptx":1500,"cuda_archs_loose_intersecti":1501,"mpatible":1502,"marlin_archs":1503,"generate":1504,"preselected":1505,"input":1506,"pairs":1507,"schedules":1508,"marlin_gen_script":1509,"cmake_current_source_dir":1510,"gptq_marlin":1511,"generate_kernels":1512,"md5":1513,"marlin_gen_script_hash":1514,"generation":1515,"script":1516,"last":1517,"execute_process":1518,"cmake_command":1519,"pythonpath":1520,"python_executable":1521,"result_variable":1522,"marlin_generation_result":1523,"output_variable":1524,"output_file":1525,"cmake_current_binary_dir":1526,"marlin_generation":1527,"log":1528,"error_file":1529,"equal":1530,"ncheck":1531,"details":1532,"completed":1533,"changed":1534,"marlin_template_kernel_src":1535,"quantiz":1536,"eted":1537,"kernel_":1538,"set_source_files_properties":1539,"properties":1540,"compile_flags":1541,"global":1542,"template":1543,"stub":1544,"marlin_srcs":1545,"dense":1546,"marlin_cuda_kernel":1547,"marlin_24_cuda_kernel":1548,"qqq":1549,"marlin_qqq_gemm_kernel":1550,"gptq_marlin_repack":1551,"awq_marlin_repack":1552,"allspark":1553,"allspark_archs":1554,"allspark_srcs":1555,"gptq_allspark":1556,"allspark_repack":1557,"allspark_qgemm_w8a16":1558,"allspark_src":1559,"scaled_mm_3x_archs":1560,"cutlass_scaled_mm":1561,"c3x":1562,"scaled_mm_archs":1563,"0a":1564,"scaled_mm_c3x_sm90":1565,"scaled_mm_sm90_fp8":1566,"scaled_mm_sm90_int8":1567,"scaled_mm_azp_sm90_int8":1568,"scaled_mm_blockwise_sm90_fp8":1569,"denable_scaled_mm_sm90":1570,"scaled_mm_c2x":1571,"know":1572,"compiler":1573,"recommend":1574,"upgrading":1575,"intend":1576,"quantized":1577,"co":1578,"geforce":1579,"blackwell":1580,"sm120":1581,"scaled_mm_c3x_sm120":1582,"scaled_mm_sm120_fp8":1583,"scaled_mm_blockwise_sm120_fp8":1584,"denable_scaled_mm_sm120":1585,"scaled_mm_c3x_120":1586,"sm100":1587,"1a":1588,"scaled_mm_c3x_sm100":1589,"scaled_mm_sm100_fp8":1590,"scaled_mm_blockwise_sm100_fp8":1591,"denable_scaled_mm_sm100":1592,"scaled_mm_c3x_100":1593,"c2x":1594,"remaining":1595,"3x":1596,"scaled_mm_2x_archs":1597,"subtract":1598,"remove_item":1599,"denable_scaled_mm_c2x":1600,"covered":1601,"scaled_mm_c3x":1602,"cutlass_scaled_sparse_mm":1603,"cutlass_compressor":1604,"sparse_scaled_mm_c3x":1605,"denable_sparse_scaled_mm_c3x":1606,"nvfp4_scaled_mm_sm120":1607,"fp4_archs":1608,"nvfp4_quant_kernels":1609,"nvfp4_scaled_mm_sm120_kernels":1610,"denable_nvfp4_sm120":1611,"nvfp4":1612,"nvfp4_experts_quant":1613,"nvfp4_scaled_mm_kernels":1614,"denable_nvfp4_sm100":1615,"denable_cutlass_moe_sm100":1616,"mla_archs":1617,"cutlass_mla_kernels":1618,"sm100_cutlass_mla_kernel":1619,"set_gencode_flags_":1620,"ompiler_version":1621,"denable_cutlass_mla":1622,"add":1623,"include_directories":1624,"cutlass_dir":1625,"77_blackwell_fmha":1626,"moe":1627,"kernel":1628,"cutlass_moe_mm":1629,"get_cutlass_":1630,"pplx_":1631,"moe_mm_data":1632,"possible":1633,"grouped_mm_c3x_sm90":1634,"denable_cutlass_moe_sm90":1635,"grouped_mm_c3x":1636,"grouped_mm_c3x_sm100":1637,"moe_data":1638,"cutlass_moe_data_archs":1639,"blockwise_scaled_group_mm_sm100":1640,"something":1641,"sm90a":1642,"machete_archs":1643,"_archs_loose_intersection":1644,"machete_gen_script":1645,"machete_gen_script_hash":1646,"machete_generation_result":1647,"machete_generation_output":1648,"machete_generation":1649,"generated":1650,"machete_gen_sources":1651,"machete_pytorch":1652,"w4a16":1653,"quickreduce":1654,"custom_quickreduce":1655,"cutlass_include_dir":1656,"cutlass_tools_util_include_dir":1657,"cudagetdriverentrypointbyversion":1658,"wrapper":1659,"calling":1660,"causes":1661,"problems":1662,"linking":1663,"earlier":1664,"sidesteps":1665,"target_compile_definitions":1666,"cutlass_enable_dir":1667,"cutlass_enable_direct_cuda_driver_call":1668,"vllm_moe_ext_src":1669,"moe_align_sum_kernels":1670,"topk_softmax_kernels":1671,"moe_wna16":1672,"moe_permute_src":1673,"permute_unpermute_kernels":1674,"moe_permute_unpermute_kernel":1675,"moe_permute_unpermute_op":1676,"vllm_moe_wna16_src":1677,"marlin_moe_archs":1678,"moe_marlin_gen_script":1679,"marlin_moe_wna16":1680,"moe_marlin_gen_script_hash":1681,"moe_marlin_":1682,"rlin_gen_script_hash":1683,"moe_marlin_generation_result":1684,"moe_marlin_generation_output":1685,"moe_marlin_generation":1686,"moe_wnaa16_marlin_src":1687,"vllm_":1688,"vllm_rocm_ext_src":1689,"skinny_gemms":1690,"projects":1691,"external_projects":1692,"flashmla":1693,"overwrites":1694,"traceback":1695,"typing":1696,"callable":1697,"unittest":1698,"mock":1699,"find_cuda_init":1700,"fn":1701,"object":1702,"helper":1703,"function":1704,"initialization":1705,"initializes":1706,"prints":1707,"stack":1708,"trace":1709,"happens":1710,"_lazy_init":1711,"nonlocal":1712,"extract_stack":1713,"initialized":1714,"format_list":1715,"__main__":1716,"import_module":1717,"llava":1718,"fast":1719,"easy":1720,"llm":1721,"inference":1722,"serving":1723,"originally":1724,"developed":1725,"sky":1726,"computing":1727,"lab":1728,"cs":1729,"berkeley":1730,"edu":1731,"uc":1732,"evolved":1733,"driven":1734,"both":1735,"academia":1736,"industry":1737,"state":1738,"art":1739,"throughput":1740,"efficient":1741,"pagedattention":1742,"blog":1743,"2023":1744,"06":1745,"continuous":1746,"batching":1747,"incoming":1748,"requests":1749,"graph":1750,"quantizations":1751,"arxiv":1752,"abs":1753,"2210":1754,"17323":1755,"2306":1756,"00978":1757,"autoround":1758,"2309":1759,"05516":1760,"int4":1761,"int8":1762,"optimized":1763,"flashattention":1764,"speculative":1765,"decoding":1766,"chunked":1767,"prefill":1768,"flexible":1769,"seamless":1770,"popular":1771,"hugging":1772,"face":1773,"algorithms":1774,"parallel":1775,"sampling":1776,"beam":1777,"tensor":1778,"pipeline":1779,"expert":1780,"support":1781,"distributed":1782,"streaming":1783,"outputs":1784,"openai":1785,"server":1786,"gpus":1787,"intel":1788,"powerpc":1789,"aws":1790,"caching":1791,"lora":1792,"seamlessly":1793,"huggingface":1794,"transformer":1795,"llama":1796,"mixture":1797,"deepseek":1798,"v3":1799,"embedding":1800,"e5":1801,"mistral":1802,"modal":1803,"supported_models":1804,"getting":1805,"started":1806,"pip":1807,"getting_started":1808,"bash":1809,"visit":1810,"learn":1811,"quickstart":1812,"welcome":1813,"collaborations":1814,"sponsors":1815,"compute":1816,"resources":1817,"thank":1818,"alphabetical":1819,"cash":1820,"donations":1821,"a16z":1822,"dropbox":1823,"sequoia":1824,"capital":1825,"skywork":1826,"zhenfund":1827,"alibaba":1828,"cloud":1829,"anyscale":1830,"crusoe":1831,"databricks":1832,"deepinfra":1833,"google":1834,"nebius":1835,"novita":1836,"replicate":1837,"roblox":1838,"runpod":1839,"trainy":1840,"san":1841,"diego":1842,"sponsor":1843,"fundraising":1844,"venue":1845,"opencollective":1846,"plan":1847,"fund":1848,"maintenance":1849,"adoption":1850,"citation":1851,"research":1852,"cite":1853,"paper":1854,"06180":1855,"bibtex":1856,"inproceedings":1857,"kwon2023efficient":1858,"title":1859,"author":1860,"woosuk":1861,"kwon":1862,"zhuohan":1863,"li":1864,"siyuan":1865,"zhuang":1866,"ying":1867,"sheng":1868,"lianmin":1869,"zheng":1870,"cody":1871,"hao":1872,"yu":1873,"joseph":1874,"gonzalez":1875,"zhang":1876,"ion":1877,"stoica":1878,"booktitle":1879,"proceedings":1880,"acm":1881,"sigops":1882,"29th":1883,"symposium":1884,"operating":1885,"systems":1886,"principles":1887,"start":1888,"technical":1889,"discussing":1890,"fellow":1891,"forum":1892,"discuss":1893,"coordinating":1894,"partnerships":1895,"lists":1896,"mailto":1897,"kit":1898,"logo":1899,"refer":1900,"summary":1901,"essential":1902,"elements":1903,"effective":1904,"description":1905,"checklist":1906,"fix":1907,"resolve":1908,"pasting":1909,"necessary":1910,"updating":1911,"submitting":1912,"anything":1913,"hfrunner":1914,"get_default_device":1915,"platforms":1916,"current_platform":1917,"is_cpu":1918,"device_type":1919,"wrap_device":1920,"_t":1921,"isinstance":1922,"hasattr":1923,"model_name":1924,"dtype":1925,"auto":1926,"model_kwargs":1927,"trust_remote_code":1928,"is_sentence_transformer":1929,"is_cross_encoder":1930,"skip_tokenizer_init":1931,"auto_cls":1932,"_baseautomodelclass":1933,"automodelforcausallm":1934,"maybe_model_redirect":1935,"config":1936,"autoconfig":1937,"from_pretrained":1938,"torch_dtype":1939,"_get_and_verify_dtype":1940,"is_pooling_model":1941,"lazy":1942,"init":1943,"sentence_transformers":1944,"sentencetransformer":1945,"former":1946,"crossencoder":1947,"automodel_args":1948,"unquantized":1949,"custom":1950,"getattr":1951,"quantization_method":1952,"parameters":1953,"bitsandbytes":1954,"tokenizer":1955,"autotokenizer":1956,"don":1957,"put":1958,"top":1959,"call":1960,"device_count":1961,"transformers":1962,"autoprocessor":1963,"noqa":1964,"f401":1965,"processor":1966,"el_name":1967,"get_inputs":1968,"prompts":1969,"images":1970,"promptimageinput":1971,"videos":1972,"promptvideoinput":1973,"audios":1974,"promptaudioinput":1975,"union":1976,"batchfeature":1977,"batchencoding":1978,"all_inputs":1979,"prompt":1980,"enumerate":1981,"processor_kwargs":1982,"return_tensors":1983,"pt":1984,"image":1985,"audio_inputs":1986,"hack":1987,"processors":1988,"sampling_rate":1989,"clean":1990,"sr":1991,"inputs":1992,"get_prompt_embeddings":1993,"sel":1994,"embeddings":1995,"input_ids":1996,"get_input_embeddings":1997,"squeeze":1998,"classify":1999,"logits":2000,"softmax":2001,"dim":2002,"tolist":2003,"kwargs":2004,"tuple":2005,"output_ids":2006,"use_cache":2007,"output_str":2008,"batch_decode":2009,"skip_special_tokens":2010,"clean_up_tokenization_spaces":2011,"generate_greedy":2012,"max_tokens":2013,"do_sample":2014,"max_new_tokens":2015,"generate_beam_search":2016,"beam_width":2017,"num_beams":2018,"num_return_sequences":2019,"pad_token_id":2020,"generate_greedy_logprobs":2021,"all_logprobs":2022,"output_hidden_states":2023,"return_dict_in_generate":2024,"seq_logprobs":2025,"_hidden_states_to_seq_logprobs":2026,"hidden_states":2027,"output_embeddings":2028,"get_output_embeddings":2029,"hidden_state":2030,"last_hidden_states":2031,"matmul":2032,"weight":2033,"bias":2034,"outpu":2035,"ddings":2036,"unsqueeze":2037,"logprobs":2038,"log_softmax":2039,"float32":2040,"_hidden_states_to_logprobs":2041,"num_logprobs":2042,"float":2043,"output_len":2044,"convert":2045,"seq_logprobs_lst":2046,"tok_idx":2047,"tok_logprobs":2048,"drop":2049,"reshape":2050,"topk":2051,"tok_logprobs_dct":2052,"token_id":2053,"logprob":2054,"zip":2055,"indices":2056,"values":2057,"item":2058,"generate_greedy_logprobs_limit":2059,"tokenstextlogprobs":2060,"all_output_ids":2061,"all_output_strs":2062,"seq_ids":2063,"sequences":2064,"output_logprobs":2065,"generate_encoder_decoder_greedy_logprobs_limit":2066,"encoder_decoder_prompts":2067,"explicitencoderdecoderprompt":2068,"greedy":2069,"encoder":2070,"decoder":2071,"encoder_prompt":2072,"decoder_prompt":2073,"to_enc_dec_tuple_list":2074,"put_strs":2075,"encoder_inputs":2076,"decoder_input_ids":2077,"decoder_inputs":2078,"decoder_hidden_states":2079,"encode":2080,"args":2081,"tput_str":2082,"predict":2083,"convert_to_tensor":2084,"__enter__":2085,"__exit__":2086,"exc_type":2087,"exc_value":2088,"del":2089,"cleanup_dist_env_and_memory":2090,"vllmrunner":2091,"arguments":2092,"modified":2093,"follows":2094,"convenience":2095,"seed":2096,"reproducibility":2097,"max_model_len":2098,"1024":2099,"block_size":2100,"64":2101,"devices":2102,"enable_chunked_prefill":2103,"enforce_eager":2104,"runner":2105,"runneroption":2106,"convertoption":2107,"tokenizer_name":2108,"tokenizer_mode":2109,"disable_log_stats":2110,"tensor_parallel_size":2111,"is_available":2112,"swap_space":2113,"odel_len":2114,"textprompt":2115,"multimodal":2116,"length":2117,"multi_modal_data":2118,"text_prompt_kwargs":2119,"prompt_token_ids":2120,"prompt_embeds":2121,"sampling_params":2122,"samplingparams":2123,"ut":2124,"req_outputs":2125,"req_output":2126,"prompt_str":2127,"prompt_ids":2128,"req_sample_output_ids":2129,"req_sample_output_strs":2130,"sample":2131,"token_ids":2132,"_final_steps_generate_w_logprobs":2133,"requestoutput":2134,"tokenstextlogprobspromptlogprobs":2135,"prompt_logprobs":2136,"generate_w_logprobs":2137,"toks_str_logsprobs_prompt_logprobs":2138,"omit":2139,"params":2140,"generate_encoder_decoder_w_logprobs":2141,"inal_steps_generate_w_logprobs":2142,"greedy_params":2143,"temperature":2144,"num_prompt_logprobs":2145,"stop_token_ids":2146,"stop":2147,"greedy_logprobs_params":2148,"greedy_logprobs_p":2149,"probs":2150,"generate_encoder_decoder_greedy_logprobs":2151,"beam_search":2152,"beamsearchparams":2153,"returned_outputs":2154,"tokens":2155,"texts":2156,"embed":2157,"reward":2158,"score":2159,"text_1":2160,"text_2":2161,"apply_model":2162,"func":2163,"nn":2164,"_r":2165,"llm_engine":2166,"v1":2167,"vllm_enable_v1_multiprocessing":2168,"executor":2169,"vllm_allow_insecure_serialization":2170,"_apply_model":2171,"get_model":2172,"collective_rpc":2173,"enum":2174,"typeddict":2175,"typevar":2176,"numpy":2177,"np":2178,"pytest":2179,"huggingface_hub":2180,"snapshot_download":2181,"pil":2182,"auto_factory":2183,"tests":2184,"audioasset":2185,"imageasset":2186,"videoasset":2187,"connections":2188,"global_http_connection":2189,"init_distributed_environment":2190,"initialize_model_parallel":2191,"zip_enc_dec_prompts":2192,"init_logger":2193,"transformers_utils":2194,"_test_dir":2195,"_test_prompts":2196,"_long_prompts":2197,"_sys_msg":2198,"system_messages":2199,"sonnet3":2200,"5_nov2024":2201,"_m":2202,"_promptmultimodalinput":2203,"ndarray":2204,"_read_prompts":2205,"imageassetprompts":2206,"stop_sign":2207,"cherry_blossom":2208,"imagetestassets":2209,"method":2210,"returned":2211,"iterating":2212,"videoassetprompts":2213,"baby_reading":2214,"videotestassets":2215,"audioassetprompts":2216,"mary_had_lamb":2217,"winning_call":2218,"audiotestassets":2219,"image_assets":2220,"singleton":2221,"instance":2222,"video_assets":2223,"audio_assets":2224,"cleanup_vllm_use_v1":2225,"monkeypatch":2226,"oracle":2227,"vllm_use_v1":2228,"loading":2229,"means":2230,"invocation":2231,"touch":2232,"cleaned":2233,"fixture":2234,"delete":2235,"upon":2236,"modifies":2237,"setenv":2238,"delenv":2239,"run_with_both_engines":2240,"runs":2241,"twice":2242,"use_v1":2243,"param":2244,"decorated":2245,"skip_v1":2246,"skip_v0":2247,"get_closest_marker":2248,"yield":2249,"autouse":2250,"init_test_http_connection":2251,"pytest_asyncio":2252,"different":2253,"loop":2254,"async":2255,"client":2256,"anew":2257,"reuse_client":2258,"dist_init":2259,"temp_file":2260,"mkstemp":2261,"world_size":2262,"rank":2263,"distributed_init_method":2264,"local_rank":2265,"nccl":2266,"should_do_global_cleanup_after_test":2267,"subdirectories":2268,"cleanup":2269,"provide":2270,"10x":2271,"speedup":2272,"unit":2273,"initialize":2274,"skip_global_cleanup":2275,"cleanup_fixture":2276,"dynamo_reset":2277,"_dynamo":2278,"reset":2279,"example_prompts":2280,"example_system_message":2281,"decoderprompttype":2282,"empty_str":2283,"example_encoder_decoder_prompts":2284,"wherein":2285,"pair":2286,"entries":2287,"corresponds":2288,"reverse":2289,"encoder_prompts":2290,"custom_decoder_prompts":2291,"empty_str_decoder_prompts":2292,"none_decoder_prompts":2293,"example_long_prompts":2294,"session":2295,"hf_runner":2296,"vllm_runner":2297,"temporary_enable_log_propagate":2298,"propagate":2299,"caplog_vllm":2300,"caplog":2301,"capture":2302,"temporarily":2303,"logs":2304,"propagated":2305,"num_gpus_available":2306,"initializing":2307,"gettempdir":2308,"_dummy_opt_path":2309,"dummy_opt":2310,"_dummy_llava_path":2311,"dummy_llava":2312,"_dummy_gemma2_embedding_path":2313,"dummy_gemma2_embedding":2314,"dummy_opt_path":2315,"json_path":2316,"repo_id":2317,"facebook":2318,"opt":2319,"125m":2320,"local_dir":2321,"ignore_patterns":2322,"h5":2323,"msgpack":2324,"load":2325,"myoptforcausallm":2326,"dump":2327,"dummy_llava_path":2328,"hf":2329,"7b":2330,"myllava":2331,"dummy_gemma2_embedding_path":2332,"baai":2333,"bge":2334,"multilingual":2335,"gemma2":2336,"mygemma2embedding":2337,"flag":2338,"mark":2339,"pytest_addoption":2340,"parser":2341,"addoption":2342,"store_true":2343,"help":2344,"pytest_collection_modifyitems":2345,"getoption":2346,"cli":2347,"skip_optional":2348,"reason":2349,"option":2350,"keywords":2351,"add_marker":2352,"cli_config_file":2353,"test_config":2354,"yaml":2355,"cli_config_file_with_model":2356,"test_config_with_model":2357,"parse_and_batch_prompt":2358,"string_inputs":2359,"foo":2360,"bar":2361,"baz":2362,"qux":2363,"token_inputs":2364,"inputs_slices":2365,"slice":2366,"test_parse_single_batch_empty":2367,"raises":2368,"parametrize":2369,"string_input":2370,"test_parse_single_batch_string_consistent":2371,"token_input":2372,"test_parse_single_batch_token_consistent":2373,"inputs_slice":2374,"test_parse_single_batch_string_slice":2375,"test_zip_enc_dec_prompts":2376,"mm_processor_kwargs":2377,"expected_mm_kwargs":2378,"zipping":2379,"enc":2380,"another":2381,"decoder_prompts":2382,"zipped_prompts":2383,"exp_kwargs":2384,"zipped":2385,"keys":2386,"remoteopenaiserver":2387,"dummy_api_key":2388,"token":2389,"abc123":2390,"_start_server":2391,"vllm_serve_args":2392,"env_dict":2393,"subclasses":2394,"customize":2395,"launch":2396,"safe":2397,"spawn":2398,"vllm_worker_multiproc_method":2399,"proc":2400,"popen":2401,"stderr":2402,"auto_port":2403,"max_wait_seconds":2404,"port":2405,"unix":2406,"sockets":2407,"uds":2408,"mutate":2409,"get_open_port":2410,"flexibleargumentparser":2411,"su":2412,"hen":2413,"subparsers":2414,"add_subparsers":2415,"dest":2416,"subparser":2417,"servesubcommand":2418,"subparser_init":2419,"parse_args":2420,"host":2421,"localhost":2422,"show_hidden_metrics":2423,"show_hidden_metrics_for_version":2424,"starting":2425,"timeout":2426,"is_local":2427,"isdir":2428,"engine_args":2429,"asyncengineargs":2430,"from_cli_args":2431,"model_config":2432,"create_model_config":2433,"load_config":2434,"create_load_config":2435,"model_loader":2436,"get_model_loader":2437,"download_model":2438,"240":2439,"_wait_for_server":2440,"url_for":2441,"health":2442,"terminate":2443,"wait":2444,"timeoutexpired":2445,"kill":2446,"_poll":2447,"polling":2448,"poll":2449,"httpx":2450,"transport":2451,"httptransport":2452,"while":2453,"status_code":2454,"break":2455,"raised":2456,"ready":2457,"useful":2458,"exited":2459,"unexpectedly":2460,"sleep":2461,"property":2462,"url_root":2463,"http":2464,"parts":2465,"get_client":2466,"600":2467,"base_url":2468,"api_key":2469,"max_retries":2470,"get_async_client":2471,"asyncopenai":2472,"_test_completion":2473,"completion":2474,"completions":2475,"single_completion":2476,"choices":2477,"finish_reason":2478,"ids":2479,"seeded":2480,"random":2481,"33":2482,"seeded_sampling":2483,"choice":2484,"simple":2485,"batch":2486,"simple_list":2487,"text0":2488,"text1":2489,"stream":2490,"chunk":2491,"compare_all_settings":2492,"all_args":2493,"all_envs":2494,"several":2495,"environments":2496,"argument":2497,"dictionaries":2498,"mode":2499,"get_tokenizer":2500,"can_force_load_format":2501,"hello":2502,"my":2503,"ref_results":2504,"comparing":2505,"usually":2506,"weights":2507,"dummy":2508,"vllm_test_force_load_format":2509,"compare_results":2510,"served_model":2511,"models_list":2512,"id":2513,"generate_close":2514,"_test_completion_close":2515,"generate_chat":2516,"_test_chat":2517,"generate_with_image":2518,"_test_image_text":2519,"upload":2520,"wikimedia":2521,"wikipedia":2522,"commons":2523,"0b":2524,"rgba_comp":2525,"png":2526,"_test_embeddings":2527,"fails":2528,"ref_args":2529,"ref_envs":2530,"compare_args":2531,"compare_envs":2532,"ref_result":2533,"compare_result":2534,"deepcopy":2535,"ll_envs":2536,"sim":2537,"cosine_similarity":2538,"999":2539,"wait_for_gpu_memory_to_clear":2540,"threshold_bytes":2541,"threshold_ratio":2542,"timeout_s":2543,"120":2544,"nvml":2545,"measurement":2546,"get_physical_device_indices":2547,"start_time":2548,"output_raw":2549,"is_rocm":2550,"dev_handle":2551,"amdsmi_get_processor_handles":2552,"mem_info":2553,"amdsmi_get_gpu_vram_usage":2554,"gb_used":2555,"vram_used":2556,"gb_total":2557,"vram_total":2558,"nvmldevicegethandlebyindex":2559,"nvmldevicegetmemoryinfo":2560,"30":2561,"total":2562,"02f":2563,"gib":2564,"is_free":2565,"threshold":2566,"2f":2567,"dur_s":2568,"waiting":2569,"r_s":2570,"asyncio":2571,"functools":2572,"signal":2573,"contextlib":2574,"contextmanager":2575,"multiprocessing":2576,"literal":2577,"cloudpickle":2578,"typing_extensions":2579,"paramspec":2580,"texttextlogprobs":2581,"ensure_model_parallel_initialized":2582,"engine":2583,"arg_utils":2584,"entrypoints":2585,"gb_bytes":2586,"cuda_device_count_stateless":2587,"amdsmi":2588,"amdsmi_init":2589,"amdsmi_shut_down":2590,"_nvml":2591,"is_cuda":2592,"third_party":2593,"pynvml":2594,"nvmlinit":2595,"nvmlshutdown":2596,"vllm_path":2597,"remoteopenaiservercustom":2598,"child":2599,"child_process_fxn":2600,"ignore":2601,"assignment":2602,"store":2603,"invoke":2604,"superclass":2605,"constructor":2606,"indirectly":2607,"exitcode":2608,"is_alive":2609,"top_logprobs":2610,"completion_close":2611,"role":2612,"user":2613,"chat_response":2614,"chat":2615,"encoding_format":2616,"single_embedding":2617,"image_url":2618,"pure":2619,"feel":2620,"today":2621,"chat_completion":2622,"pure_text":2623,"text_image":2624,"compare_two_settings":2625,"arg1":2626,"arg2":2627,"env1":2628,"env2":2629,"two":2630,"second":2631,"init_test_distributed_environment":2632,"tp_size":2633,"pp_size":2634,"distributed_init_port":2635,"tcp":2636,"multi_process_parallel":2637,"test_target":2638,"ray":2639,"helps":2640,"debugging":2641,"compared":2642,"working_dir":2643,"workers":2644,"gitignore":2645,"excluding":2646,"move":2647,"dir":2648,"ray_runtime_env_ignore_gitignore":2649,"runtime_env":2650,"excludes":2651,"shellcheck":2652,"dist":2653,"refs":2654,"shutdown":2655,"error_on_warning":2656,"category":2657,"manager":2658,"fail":2659,"emitted":2660,"catch_warnings":2661,"filterwarnings":2662,"visible_devices":2663,"cuda_visible_devices":2664,"visible_indices":2665,"index_mapping":2666,"_p":2667,"fork_new_process_for_each_test":2668,"decorator":2669,"fork":2670,"7053":2671,"wraps":2672,"leader":2673,"own":2674,"sending":2675,"sigterm":2676,"setpgrp":2677,"_pytest":2678,"outcomes":2679,"skipped":2680,"pid":2681,"_exit":2682,"print_exc":2683,"pgid":2684,"getpgid":2685,"_pid":2686,"_exitcode":2687,"waitpid":2688,"itself":2689,"old_signal_handler":2690,"sig_ign":2691,"processes":2692,"killpg":2693,"restore":2694,"handler":2695,"called":2696,"spawn_new_process_for_each_test":2697,"running_in_subprocess":2698,"mp":2699,"set_start_method":2700,"__module__":2701,"temporarydirectory":2702,"tempdir":2703,"output_filepath":2704,"new_process":2705,"tmp":2706,"pickling":2707,"complex":2708,"input_bytes":2709,"dumps":2710,"cmd":2711,"successful":2712,"check_returncode":2713,"wrap":2714,"create_new_process_for_each_test":2715,"creates":2716,"creation":2717,"separate":2718,"use_spawn":2719,"is_xpu":2720,"large_gpu_mark":2721,"min_gb":2722,"markdecorator":2723,"skips":2724,"meet":2725,"minimum":2726,"requirement":2727,"gb":2728,"leveraged":2729,"large_gpu_test":2730,"enough":2731,"filtering":2732,"memory_gb":2733,"get_device_total_memory":2734,"finding":2735,"stacklevel":2736,"skipif":2737,"decorate":2738,"machine":2739,"l4":2740,"24":2741,"vram":2742,"multi_gpu_marks":2743,"num_gpus":2744,"collection":2745,"marks":2746,"multi_gpu_test":2747,"test_selector":2748,"test_skipif":2749,"reversed":2750,"completions_with_server_args":2751,"server_cli_args":2752,"construct":2753,"obtain":2754,"spin":2755,"interval":2756,"bringing":2757,"240sec":2758,"max_token":2759,"max_tok":2760,"await":2761,"gather":2762,"get_client_text_generations":2763,"protocol":2764,"endpoint":2765,"get_client_text_logprob_generations":2766,"operates":2767,"obtains":2768,"sequencegroup":2769,"text_generations":2770,"has_module_attribute":2771,"attribute_name":2772,"attribute":2773,"importerror":2774,"get_attn_backend_list_based_on_platform":2775,"flash_attn_vllm_v1":2776,"triton_attn_vllm_v1":2777,"tree_attn":2778,"attn_backend_list":2779,"aiter":2780,"modelconfig":2781,"chatcompletionrequest":2782,"qwen":2783,"qwen1":2784,"test_max_tokens_none":2785,"01":2786,"top_p":2787,"float16":2788,"default_max_tokens":2789,"4096":2790,"test_sampling_params_from_request_with_no_guided_decoding_backend":2791,"guided_decoding_backend":2792,"model_validate":2793,"response_format":2794,"json_object":2795,"to_sampling_params":2796,"logits_processor_pattern":2797,"expect":2798,"guided_decoding":2799,"test_sampling_params_from_request_with_guided_decoding_backend":2800,"request_level_guided_decoding_backend":2801,"identified":2802,"resulting":2803,"get_vllm_port":2804,"test_get_vllm_port_not_set":2805,"vllm_port":2806,"test_get_vllm_port_valid":2807,"valid":2808,"integer":2809,"5678":2810,"test_get_vllm_port_invalid":2811,"abc":2812,"test_get_vllm_port_uri":2813,"uri":2814,"appears":2815,"routing":2816,"simulator":2817,"demonstrates":2818,"strategies":2819,"analyze":2820,"fusedmoe":2821,"layer":2822,"routing_simulator":2823,"distributionbasedrouting":2824,"routingsimulator":2825,"test_basic_functionality":2826,"num_tokens":2827,"hidden_size":2828,"num_experts":2829,"top_k":2830,"basic":2831,"functionality":2832,"strategy":2833,"get_available_strategies":2834,"randn":2835,"router_logits":2836,"simulate":2837,"topk_weights":2838,"topk_ids":2839,"simulate_routing":2840,"strategy_name":2841,"shape":2842,"wrong":2843,"min":2844,"invalid":2845,"negative":2846,"too":2847,"test_routing_strategy_integration":2848,"importorskip":2849,"32":2850,"env_name":2851,"vllm_moe_routing_simulation_strategy":2852,"reload":2853,"environment_variables":2854,"select_experts":2855,"use_grouped_topk":2856,"renormalize":2857,"indices_type":2858,"long":2859,"test_distribution_based_routing_with_custom_strategy":2860,"registering":2861,"register":2862,"distribution":2863,"custom_strategy":2864,"normal":2865,"mean":2866,"std":2867,"register_strategy":2868,"custom_normal":2869,"60":2870,"48":2871,"test_instance_compatibility":2872,"methods":2873,"uniform_random":2874,"interface":2875,"test_seed_behavior":2876,"seed_everything":2877,"42":2878,"random_value_1":2879,"randint":2880,"100":2881,"np_random_value_1":2882,"torch_random_value_1":2883,"random_value_2":2884,"np_random_value_2":2885,"torch_random_value_2":2886,"dataclasses":2887,"dataclass":2888,"jsondecodeerror":2889,"namedtemporaryfile":2890,"magicmock":2891,"uuid":2892,"uuid4":2893,"requestlogger":2894,"_date_format":2895,"_format":2896,"_configure_vllm_root_logger":2897,"enable_trace_function_call":2898,"logging_utils":2899,"newlineformatter":2900,"dump_input":2901,"prepare_object_to_dump":2902,"f1":2903,"f2":2904,"test_trace_function_call":2905,"fd":2906,"cur_dir":2907,"settrace":2908,