{"class":0,"cmake_build_ext":1,"build_ext":2,"dict":3,"extension":4,"directories":5,"have":6,"been":7,"configured":8,"did_config":9,"str":10,"bool":11,"determine":12,"number":13,"compilation":14,"jobs":15,"optionally":16,"nvcc":17,"compile":18,"threads":19,"def":20,"compute_num_jobs":21,"self":22,"num_jobs":23,"either":24,"value":25,"max_jobs":26,"environment":27,"variable":28,"defined":29,"cpus":30,"available":31,"envs":32,"none":33,"int":34,"logger":35,"info":36,"using":37,"else":38,"try":39,"os":40,"sched_getaffinity":41,"isn":42,"universally":43,"so":44,"fall":45,"back":46,"cpu_count":47,"we":48,"get":49,"error":50,"here":51,"len":52,"except":53,"attributeerror":54,"nvcc_threads":55,"_is_cuda":56,"get_nvcc_cuda_version":57,"version":58,"11":59,"when":60,"set":61,"reduce":62,"avoid":63,"overloading":64,"system":65,"max":66,"return":67,"perform":68,"cmake":69,"configuration":70,"single":71,"configure":72,"ext":73,"cmakeextension":74,"ve":75,"already":76,"cmakelists":77,"txt":78,"exit":79,"early":80,"cmake_lists_dir":81,"true":82,"akelists":83,"select":84,"build":85,"type":86,"note":87,"optimization":88,"level":89,"debug":90,"default_cfg":91,"relwithdebinfo":92,"cfg":93,"cmake_build_type":94,"cmake_args":95,"dcmake_build_type":96,"format":97,"dvllm_target_device":98,"vllm_target_device":99,"verbose":100,"dcmake_verbose_makefile":101,"is_sccache_available":102,"dcmake_c_compiler_launcher":103,"sccache":104,"dcmake_cxx_compiler_launcher":105,"dcmake_cuda_compiler_launcher":106,"dcmake_hip_compiler_launcher":107,"elif":108,"is_ccache_available":109,"ccache":110,"pass":111,"python":112,"executable":113,"can":114,"find":115,"exact":116,"match":117,"dvllm_python_executable":118,"sys":119,"path":120,"reuse":121,"dependencies":122,"subsequent":123,"calls":124,"dvllm_python_path":125,"join":126,"override":127,"base":128,"directory":129,"fetchcontent":130,"downloads":131,"root":132,"deps":133,"allows":134,"sharing":135,"between":136,"profiles":137,"plays":138,"more":139,"nicely":140,"fetchcontent_base_dir":141,"fc_base_dir":142,"root_dir":143,"en":144,"environ":145,"dfetchcontent_base_dir":146,"setup":147,"parallelism":148,"tool":149,"dnvcc_threads":150,"is_ninja_available":151,"build_tool":152,"ninja":153,"dcmake_job_pool_compile":154,"string":155,"dcmake_job_pools":156,"default":157,"whatever":158,"picks":159,"make":160,"sure":161,"use":162,"from":163,"cuda_home":164,"dcmake_cuda_compiler":165,"bin":166,"subprocess":167,"check_call":168,"cwd":169,"build_temp":170,"build_extensions":171,"ensure":172,"present":173,"working":174,"check_output":175,"oserror":176,"raise":177,"runtimeerror":178,"cannot":179,"create":180,"does":181,"exist":182,"exists":183,"makedirs":184,"targets":185,"target_name":186,"removeprefix":187,"vllm":188,"vllm_flash_attn":189,"all":190,"extensions":191,"append":192,"name":193,"build_args":194,"nu":195,"elf":196,"target":197,"install":198,"libraries":199,"proper":200,"location":201,"outdir":202,"get_ext_fullpath":203,"parent":204,"absolute":205,"skip":206,"same":207,"continue":208,"appends":209,"prefix":210,"contains":211,"need":212,"remove":213,"range":214,"count":215,"should":216,"actually":217,"components":218,"install_args":219,"component":220,"run":221,"first":222,"standard":223,"command":224,"super":225,"copy":226,"py":227,"build_lib":228,"current":229,"included":230,"editable":231,"import":232,"glob":233,"files":234,"recursive":235,"file":236,"dst_file":237,"split":238,"print":239,"copying":240,"dirname":241,"dst_fi":242,"exist_ok":243,"copy_file":244,"precompiled_wheel_utils":245,"extracts":246,"other":247,"existing":248,"wheel":249,"staticmethod":250,"extract_precompiled_and_patch_package":251,"wheel_url_or_path":252,"tempfile":253,"zipfile":254,"temp_dir":255,"isfile":256,"wheel_filename":257,"mkdtemp":258,"wheels":259,"wheel_path":260,"downloading":261,"urllib":262,"request":263,"urlretrieve":264,"filename":265,"package_data_patch":266,"files_to_copy":267,"_c":268,"abi3":269,"_moe_c":270,"_flashmla_c":271,"_vllm_fa2_c":272,"_vllm_fa3_c":273,"cumem_allocator":274,"compiled_regex":275,"re":276,"file_members":277,"list":278,"filter":279,"lambda":280,"filelist":281,"extract":282,"target_path":283,"target_pa":284,"le":285,"open":286,"src":287,"wb":288,"dst":289,"shutil":290,"copyfileobj":291,"pkg":292,"replace":293,"setdefault":294,"basename":295,"finally":296,"removing":297,"temporary":298,"rmtree":299,"get_base_commit_in_main_branch":300,"force":301,"nightly":302,"mainly":303,"used":304,"ci":305,"testing":306,"vllm_test_use_precompiled_nightly_wheel":307,"latest":308,"commit":309,"hash":310,"upstream":311,"main":312,"branch":313,"resp_json":314,"curl":315,"https":316,"api":317,"github":318,"com":319,"repos":320,"project":321,"commits":322,"decode":323,"utf":324,"upstream_main_commit":325,"json":326,"loads":327,"sha":328,"docker":329,"context":330,"git":331,"may":332,"immutable":333,"missing":334,"vllm_docker_build_context":335,"check":336,"local":337,"repo":338,"cat":339,"calledprocesserror":340,"fetch":341,"remote":342,"repository":343,"update":344,"any":345,"branches":346,"ensures":347,"ref":348,"its":349,"history":350,"our":351,"current_branch":352,"show":353,"strip":354,"base_commit":355,"merge":356,"valueerror":357,"err":358,"exception":359,"warning":360,"failed":361,"compatible":362,"your":363,"dev":364,"ctypes":365,"importlib":366,"util":367,"logging":368,"pathlib":369,"which":370,"torch":371,"packaging":372,"parse":373,"setuptools":374,"setuptools_scm":375,"get_version":376,"utils":377,"cpp_extension":378,"rocm_home":379,"load_module_from_path":380,"module_name":381,"spec":382,"spec_from_file_location":383,"module":384,"module_from_spec":385,"modules":386,"loader":387,"exec_module":388,"__file__":389,"getlogger":390,"__name__":391,"directly":392,"because":393,"depends":394,"installed":395,"yet":396,"platform":397,"startswith":398,"darwin":399,"cpu":400,"automatically":401,"due":402,"macos":403,"linux":404,"only":405,"supports":406,"including":407,"wsl":408,"building":409,"able":410,"correctly":411,"empty":412,"cuda":413,"getenv":414,"hip":415,"fallback":416,"main_cuda_version":417,"12":418,"vllm_disable_sccache":419,"is_url_available":420,"url":421,"urlopen":422,"status":423,"false":424,"200":425,"__init__":426,"kwa":427,"sources":428,"py_limited_api":429,"abspath":430,"precompiled_build_ext":431,"disables":432,"precompiled":433,"binaries":434,"assert":435,"vllm_use_precompiled":436,"supported":437,"builds":438,"skipping":439,"_no_device":440,"has_cuda":441,"_is_neuron":442,"_is_tpu":443,"_is_hip":444,"rocm":445,"neuron":446,"tpu":447,"_is_cpu":448,"_is_xpu":449,"xpu":450,"_build_custom_ops":451,"get_rocm_version":452,"librocm":453,"core":454,"see":455,"blob":456,"d11f5c20d500f729c393680a01fa902ebf92094b":457,"rocm_version":458,"cpp":459,"l21":460,"librocm_core_file":461,"lib":462,"is_file":463,"librocm_core":464,"cdll":465,"vererrors":466,"c_uint32":467,"get_rocm_core_version":468,"getrocmversion":469,"restype":470,"argtypes":471,"pointer":472,"major":473,"minor":474,"patch":475,"byref":476,"get_neuronxcc_version":477,"sysconfig":478,"site_dir":479,"get_paths":480,"purelib":481,"version_file":482,"neuronxcc":483,"executed":484,"successfully":485,"fp":486,"content":487,"read":488,"regular":489,"expression":490,"search":491,"__version__":492,"group":493,"could":494,"output":495,"adapted":496,"nvidia":497,"apex":498,"8b7a1ff183741dd8f9b87e7bafd04cfde99cea28":499,"nvcc_output":500,"universal_newlines":501,"release_idx":502,"index":503,"release":504,"nvcc_cuda_version":505,"get_gaudi_sw_version":506,"returns":507,"driver":508,"enable":509,"console":510,"printing":511,"hl":512,"smi":513,"shell":514,"text":515,"capture_output":516,"env":517,"enable_console":518,"returncode":519,"stdout":520,"get_vllm_version":521,"write_to":522,"_version":523,"sep":524,"versions":525,"might":526,"contain":527,"cuda_version":528,"cuda_version_str":529,"source":530,"tarball":531,"required":532,"pypi":533,"sdist":534,"argv":535,"cu":536,"neuron_version":537,"neuron_version_str":538,"unknown":539,"runtime":540,"get_requirements":541,"package":542,"requirements":543,"requirements_dir":544,"_read_requirements":545,"resolved_requirements":546,"line":547,"common":548,"cuda_major":549,"cuda_minor":550,"modified_requirements":551,"req":552,"flash":553,"attn":554,"built":555,"unsupported":556,"please":557,"ext_modules":558,"_rocm_c":559,"fa3":560,"requires":561,"later":562,"optional":563,"since":564,"doesn":565,"produce":566,"targeting":567,"hopper":568,"package_data":569,"typed":570,"model_executor":571,"layers":572,"fused_moe":573,"configs":574,"quantization":575,"wheel_location":576,"vllm_precompiled_wheel_location":577,"wheel_url":578,"ai":579,"cp38":580,"manylinux1_x86_64":581,"whl":582,"resp":583,"warn":584,"falling":585,"items":586,"extend":587,"cmdclass":588,"static":589,"metadata":590,"rather":591,"go":592,"pyproject":593,"toml":594,"install_requires":595,"extras_require":596,"bench":597,"pandas":598,"datasets":599,"tensorizer":600,"10":601,"fastsafetensors":602,"runai":603,"model":604,"streamer":605,"13":606,"s3":607,"boto3":608,"audio":609,"librosa":610,"soundfile":611,"mistral_common":612,"processing":613,"video":614,"kept":615,"backwards":616,"compatibility":617,"flashinfer":618,"updated":619,"together":620,"dockerfile":621,"releasing":622,"releases":623,"offer":624,"reliable":625,"code":626,"packaged":627,"binary":628,"conveniently":629,"accessed":630,"via":631,"also":632,"serve":633,"key":634,"milestones":635,"development":636,"team":637,"communicate":638,"community":639,"about":640,"newly":641,"features":642,"improvements":643,"upcoming":644,"changes":645,"affect":646,"users":647,"potential":648,"breaking":649,"versioning":650,"uses":651,"right":652,"shifted":653,"scheme":654,"where":655,"new":656,"out":657,"every":658,"weeks":659,"bug":660,"fixes":661,"opposed":662,"semver":663,"critical":664,"made":665,"special":666,"post1":667,"released":668,"_major_":669,"architectural":670,"milestone":671,"incompatible":672,"similar":673,"pytorch":674,"_minor_":675,"_patch_":676,"_post1_":677,"_patch":678,"1_":679,"explicit":680,"implicit":681,"post":682,"cadence":683,"bi":684,"weekly":685,"basis":686,"days":687,"after":688,"following":689,"year":690,"2025":691,"future":692,"dates":693,"below":694,"tentative":695,"date":696,"jan":697,"feb":698,"mar":699,"apr":700,"jun":701,"jul":702,"aug":703,"14":704,"15":705,"16":706,"17":707,"oct":708,"18":709,"19":710,"nov":711,"20":712,"21":713,"dec":714,"22":715,"23":716,"each":717,"dedicated":718,"cut":719,"performed":720,"before":721,"live":722,"previously":723,"reused":724,"triggered":725,"push":726,"rc":727,"tag":728,"like":729,"vx":730,"rc1":731,"enables":732,"us":733,"test":734,"multiple":735,"rcs":736,"final":737,"trigger":738,"notes":739,"assets":740,"created":741,"monitor":742,"reverts":743,"apply":744,"cherry":745,"pick":746,"criteria":747,"approach":748,"finalizing":749,"clear":750,"what":751,"allowed":752,"process":753,"land":754,"pr":755,"typically":756,"limited":757,"has":758,"sufficient":759,"time":760,"complete":761,"thorough":762,"round":763,"stable":764,"regression":765,"address":766,"functional":767,"performance":768,"against":769,"most":770,"recent":771,"severe":772,"issue":773,"silent":774,"incorrectness":775,"crashes":776,"deadlocks":777,"large":778,"memory":779,"leaks":780,"introduced":781,"documentation":782,"specific":783,"change":784,"identifiers":785,"feature":786,"work":787,"prs":788,"considered":789,"merged":790,"trunk":791,"manual":792,"validations":793,"e2e":794,"validation":795,"end":796,"regressions":797,"benchmark":798,"workflow":799,"integration":800,"actions":801,"workflows":802,"yml":803,"coverage":804,"models":805,"llama3":806,"llama4":807,"mixtral":808,"hardware":809,"h100":810,"amd":811,"mi300x":812,"_note":813,"based":814,"availability_":815,"step":816,"access":817,"write":818,"review":819,"familiarize":820,"yourself":821,"configurations":822,"tree":823,"benchmarks":824,"navigate":825,"v0":826,"results":827,"once":828,"completes":829,"dashboard":830,"hud":831,"org":832,"llms":833,"reponame":834,"2fvllm":835,"under":836,"corresponding":837,"comparison":838,"compare":839,"previous":840,"verify":841,"occurred":842,"example":843,"vs":844,"starttime":845,"thu":846,"2c":847,"2017":848,"20apr":849,"202025":850,"2021":851,"3a43":852,"3a50":853,"20gmt":854,"stoptime":855,"wed":856,"2016":857,"20jul":858,"granularity":859,"week":860,"lbranch":861,"lcommit":862,"b6553be1bc75f046b00046a4ad7576364d03c835":863,"rbranch":864,"hu":865,"rcommit":866,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":867,"benchmarkname":868,"modelname":869,"20models":870,"backendname":871,"20backends":872,"modename":873,"20modes":874,"dtypename":875,"20dtype":876,"devicename":877,"20devices":878,"archname":879,"20platforms":880,"fast":881,"easy":882,"library":883,"llm":884,"inference":885,"serving":886,"originally":887,"developed":888,"sky":889,"computing":890,"lab":891,"cs":892,"berkeley":893,"edu":894,"uc":895,"evolved":896,"driven":897,"contributions":898,"both":899,"academia":900,"industry":901,"state":902,"art":903,"throughput":904,"efficient":905,"management":906,"attention":907,"pagedattention":908,"blog":909,"2023":910,"06":911,"html":912,"continuous":913,"batching":914,"incoming":915,"requests":916,"execution":917,"graph":918,"quantizations":919,"gptq":920,"arxiv":921,"abs":922,"2210":923,"17323":924,"awq":925,"2306":926,"00978":927,"autoround":928,"2309":929,"05516":930,"int4":931,"int8":932,"fp8":933,"optimized":934,"kernels":935,"flashattention":936,"speculative":937,"decoding":938,"chunked":939,"prefill":940,"flexible":941,"seamless":942,"popular":943,"hugging":944,"face":945,"high":946,"various":947,"algorithms":948,"parallel":949,"sampling":950,"beam":951,"tensor":952,"pipeline":953,"data":954,"expert":955,"support":956,"distributed":957,"streaming":958,"outputs":959,"openai":960,"server":961,"gpus":962,"intel":963,"powerpc":964,"aws":965,"caching":966,"multi":967,"lora":968,"seamlessly":969,"huggingface":970,"transformer":971,"llama":972,"mixture":973,"deepseek":974,"v2":975,"v3":976,"embedding":977,"e5":978,"mistral":979,"modal":980,"llava":981,"full":982,"docs":983,"supported_models":984,"getting":985,"started":986,"pip":987,"getting_started":988,"installation":989,"gpu":990,"bash":991,"visit":992,"learn":993,"quickstart":994,"contributing":995,"welcome":996,"collaborations":997,"how":998,"involved":999,"sponsors":1000,"compute":1001,"resources":1002,"organizations":1003,"thank":1004,"you":1005,"sort":1006,"them":1007,"alphabetical":1008,"order":1009,"keep":1010,"consistent":1011,"md":1012,"cash":1013,"donations":1014,"a16z":1015,"dropbox":1016,"sequoia":1017,"capital":1018,"skywork":1019,"zhenfund":1020,"alibaba":1021,"cloud":1022,"anyscale":1023,"crusoe":1024,"databricks":1025,"deepinfra":1026,"google":1027,"nebius":1028,"novita":1029,"replicate":1030,"roblox":1031,"runpod":1032,"trainy":1033,"san":1034,"diego":1035,"slack":1036,"sponsor":1037,"official":1038,"fundraising":1039,"venue":1040,"through":1041,"opencollective":1042,"plan":1043,"fund":1044,"maintenance":1045,"adoption":1046,"citation":1047,"research":1048,"cite":1049,"paper":1050,"06180":1051,"bibtex":1052,"inproceedings":1053,"kwon2023efficient":1054,"title":1055,"language":1056,"author":1057,"woosuk":1058,"kwon":1059,"zhuohan":1060,"li":1061,"siyuan":1062,"zhuang":1063,"ying":1064,"sheng":1065,"lianmin":1066,"zheng":1067,"cody":1068,"hao":1069,"yu":1070,"joseph":1071,"gonzalez":1072,"zhang":1073,"ion":1074,"stoica":1075,"booktitle":1076,"proceedings":1077,"acm":1078,"sigops":1079,"29th":1080,"symposium":1081,"operating":1082,"systems":1083,"principles":1084,"contact":1085,"start":1086,"technical":1087,"questions":1088,"issues":1089,"discussing":1090,"fellow":1091,"forum":1092,"discuss":1093,"coordinating":1094,"security":1095,"disclosures":1096,"advisories":1097,"partnerships":1098,"lists":1099,"mailto":1100,"media":1101,"kit":1102,"wish":1103,"logo":1104,"refer":1105,"cmake_minimum_required":1106,"26":1107,"places":1108,"correct":1109,"mkdir":1110,"cd":1111,"python3":1112,"dcmake_install_prefix":1113,"want":1114,"one":1115,"manually":1116,"vllm_extensions":1117,"languages":1118,"cxx":1119,"overridden":1120,"cache":1121,"device":1122,"backend":1123,"message":1124,"include":1125,"cmake_current_list_dir":1126,"suppress":1127,"warnings":1128,"unused":1129,"specified":1130,"variables":1131,"ignoreme":1132,"vllm_python_path":1133,"prevent":1134,"cutlass":1135,"cmake_install_local_only":1136,"all_components":1137,"searched":1138,"selected":1139,"sync":1140,"python_supported_versions":1141,"architectures":1142,"hip_supported_archs":1143,"gfx906":1144,"gfx908":1145,"gfx90a":1146,"gfx942":1147,"gfx950":1148,"gfx1030":1149,"gfx1100":1150,"gfx1101":1151,"gfx1200":1152,"gfx1201":1153,"expected":1154,"currently":1155,"having":1156,"incorrect":1157,"than":1158,"derived":1159,"torch_supported_version_cuda":1160,"torch_supported_version_rocm":1161,"exactly":1162,"matches":1163,"vllm_python_executable":1164,"n_cuda":1165,"find_python_from_executable":1166,"fatal_error":1167,"desired":1168,"running":1169,"endif":1170,"cmake_prefix_path":1171,"append_cmake_prefix_path":1172,"find_program":1173,"nvcc_executable":1174,"cuda_found":1175,"found":1176,"imports":1177,"partially":1178,"some":1179,"customizations":1180,"do":1181,"explicitly":1182,"check_language":1183,"enable_language":1184,"etc":1185,"find_package":1186,"must":1187,"happen":1188,"cmake_cuda_compiler_version":1189,"gets":1190,"version_greater_equal":1191,"cuda_supported_archs":1192,"forward":1193,"non":1194,"external":1195,"scripts":1196,"strequal":1197,"cpu_extension":1198,"up":1199,"hip_found":1200,"vllm_gpu_lang":1201,"torch_version":1202,"version_equal":1203,"saw":1204,"instead":1205,"elseif":1206,"importing":1207,"recognizes":1208,"sets":1209,"let":1210,"recognize":1211,"understand":1212,"enabled":1213,"rocm_version_dev_major":1214,"greater_equal":1215,"control":1216,"per":1217,"down":1218,"cmake_cuda_flags":1219,"applied":1220,"globally":1221,"clear_cuda_arches":1222,"cuda_arch_flags":1223,"extract_unique_cuda_archs_ascending":1224,"cuda_archs":1225,"archs":1226,"cuda_archs_loose_intersection":1227,"detected":1228,"arches":1229,"stored":1230,"vllm_gpu_a":1231,"vllm_gpu_arches":1232,"override_gpu_arches":1233,"_supported_archs":1234,"query":1235,"additional":1236,"flags":1237,"given":1238,"vllm_gpu_flags":1239,"get_torch_gpu_compiler_flags":1240,"compiled":1241,"part":1242,"play":1243,"dependency":1244,"produces":1245,"artifacts":1246,"binary_dir":1247,"conflicts":1248,"types":1249,"cmake_binary_dir":1250,"make_directory":1251,"overriding":1252,"adding":1253,"ggdb3":1254,"devug":1255,"cmake_":1256,"_flags_debug":1257,"o0":1258,"cmake_cxx_flags_debug":1259,"certain":1260,"functions":1261,"marked":1262,"nodiscard":1263,"ignores":1264,"result":1265,"generates":1266,"lot":1267,"always":1268,"mask":1269,"real":1270,"suppressing":1271,"until":1272,"properly":1273,"addressed":1274,"_flags":1275,"wno":1276,"cmake_cxx_flags":1277,"define":1278,"vllm_cumem_ext_src":1279,"csrc":1280,"set_gencode_f":1281,"e_cxx_flags":1282,"set_gencode_flags_for_srcs":1283,"srcs":1284,"enabling":1285,"cumem":1286,"allocator":1287,"link":1288,"cumem_libs":1289,"cuda_driver":1290,"define_gpu_extension_target":1291,"destination":1292,"use_sabi":1293,"with_soabi":1294,"vllm_ext_src":1295,"mamba":1296,"mamba_ssm":1297,"selective_scan_fwd":1298,"cache_kernels":1299,"paged_attention_v1":1300,"paged_attention_v2":1301,"merge_attn_states":1302,"vertical_slash_index":1303,"pos_encoding_kernels":1304,"activation_kernels":1305,"layernorm_kernels":1306,"layernorm_quant_kernels":1307,"sampler":1308,"cuda_view":1309,"q_gemm":1310,"compressed_tensors":1311,"int8_quant_kernels":1312,"fused_kernels":1313,"fused_layernorm_dynamic_per_token_quant":1314,"gguf":1315,"gguf_kernel":1316,"cuda_utils_kernels":1317,"custom_all_reduce":1318,"torch_bindings":1319,"cutlass_enable_headers_only":1320,"header":1321,"cutlass_revision":1322,"bogus":1323,"messages":1324,"v4":1325,"revision":1326,"vllm_cutlass_src_dir":1327,"provided":1328,"is_absolute":1329,"get_filename_component":1330,"fetchcontent_declare":1331,"source_dir":1332,"git_repository":1333,"above":1334,"git_tag":1335,"git_progress":1336,"speed":1337,"download":1338,"retrieving":1339,"important":1340,"git_shallow":1341,"works":1342,"names":1343,"tags":1344,"fetchcontent_makeavailable":1345,"gemm_kernels":1346,"permute_cols":1347,"cutlass_w8a8":1348,"scaled_mm_entry":1349,"fp4":1350,"nvfp4_quant_entry":1351,"nvfp4_scaled_mm_entry":1352,"nvfp4_blockwise_moe_kernel":1353,"sparse":1354,"sparse_scaled_mm_entry":1355,"cutlass_extensions":1356,"mla":1357,"cutlass_mla_entry":1358,"per_token_group_quant":1359,"marlin":1360,"least":1361,"sizes":1362,"shapes":1363,"machete":1364,"bf16":1365,"atomicadd":1366,"ptx":1367,"cuda_archs_loose_intersecti":1368,"mpatible":1369,"marlin_archs":1370,"generate":1371,"preselected":1372,"input":1373,"pairs":1374,"schedules":1375,"marlin_gen_script":1376,"cmake_current_source_dir":1377,"gptq_marlin":1378,"generate_kernels":1379,"md5":1380,"marlin_gen_script_hash":1381,"generation":1382,"script":1383,"last":1384,"execute_process":1385,"cmake_command":1386,"pythonpath":1387,"python_executable":1388,"result_variable":1389,"marlin_generation_result":1390,"output_variable":1391,"output_file":1392,"cmake_current_binary_dir":1393,"marlin_generation":1394,"log":1395,"error_file":1396,"equal":1397,"ncheck":1398,"details":1399,"completed":1400,"changed":1401,"marlin_template_kernel_src":1402,"quantiz":1403,"eted":1404,"kernel_":1405,"set_source_files_properties":1406,"properties":1407,"compile_flags":1408,"global":1409,"template":1410,"stub":1411,"marlin_srcs":1412,"dense":1413,"marlin_cuda_kernel":1414,"marlin_24_cuda_kernel":1415,"qqq":1416,"marlin_qqq_gemm_kernel":1417,"gptq_marlin_repack":1418,"awq_marlin_repack":1419,"allspark":1420,"allspark_archs":1421,"allspark_srcs":1422,"gptq_allspark":1423,"allspark_repack":1424,"allspark_qgemm_w8a16":1425,"allspark_src":1426,"scaled_mm_3x_archs":1427,"cutlass_scaled_mm":1428,"c3x":1429,"require":1430,"scaled_mm_archs":1431,"0a":1432,"scaled_mm_c3x_sm90":1433,"scaled_mm_sm90_fp8":1434,"scaled_mm_sm90_int8":1435,"scaled_mm_azp_sm90_int8":1436,"scaled_mm_blockwise_sm90_fp8":1437,"denable_scaled_mm_sm90":1438,"scaled_mm_c2x":1439,"know":1440,"compiler":1441,"recommend":1442,"upgrading":1443,"intend":1444,"quantized":1445,"co":1446,"geforce":1447,"blackwell":1448,"sm120":1449,"scaled_mm_c3x_sm120":1450,"scaled_mm_sm120_fp8":1451,"scaled_mm_blockwise_sm120_fp8":1452,"denable_scaled_mm_sm120":1453,"scaled_mm_c3x_120":1454,"sm100":1455,"1a":1456,"scaled_mm_c3x_sm100":1457,"scaled_mm_sm100_fp8":1458,"scaled_mm_blockwise_sm100_fp8":1459,"denable_scaled_mm_sm100":1460,"scaled_mm_c3x_100":1461,"c2x":1462,"remaining":1463,"3x":1464,"scaled_mm_2x_archs":1465,"subtract":1466,"remove_item":1467,"denable_scaled_mm_c2x":1468,"covered":1469,"scaled_mm_c3x":1470,"cutlass_scaled_sparse_mm":1471,"cutlass_compressor":1472,"sparse_scaled_mm_c3x":1473,"denable_sparse_scaled_mm_c3x":1474,"nvfp4_scaled_mm_sm120":1475,"fp4_archs":1476,"nvfp4_quant_kernels":1477,"nvfp4_scaled_mm_sm120_kernels":1478,"denable_nvfp4_sm120":1479,"nvfp4":1480,"were":1481,"nvfp4_experts_quant":1482,"nvfp4_scaled_mm_kernels":1483,"denable_nvfp4_sm100":1484,"denable_cutlass_moe_sm100":1485,"mla_archs":1486,"cutlass_mla_kernels":1487,"sm100_cutlass_mla_kernel":1488,"set_gencode_flags_":1489,"ompiler_version":1490,"denable_cutlass_mla":1491,"add":1492,"include_directories":1493,"cutlass_dir":1494,"examples":1495,"77_blackwell_fmha":1496,"moe":1497,"kernel":1498,"cutlass_moe_mm":1499,"get_cutlass_":1500,"pplx_":1501,"moe_mm_data":1502,"possible":1503,"grouped_mm_c3x_sm90":1504,"denable_cutlass_moe_sm90":1505,"grouped_mm_c3x":1506,"grouped_mm_c3x_sm100":1507,"moe_data":1508,"cutlass_moe_data_archs":1509,"blockwise_scaled_group_mm_sm100":1510,"something":1511,"sm90a":1512,"machete_archs":1513,"_archs_loose_intersection":1514,"machete_gen_script":1515,"machete_gen_script_hash":1516,"machete_generation_result":1517,"machete_generation_output":1518,"machete_generation":1519,"generated":1520,"machete_gen_sources":1521,"machete_pytorch":1522,"w4a16":1523,"quickreduce":1524,"custom_quickreduce":1525,"cutlass_include_dir":1526,"cutlass_tools_util_include_dir":1527,"cudagetdriverentrypointbyversion":1528,"wrapper":1529,"calling":1530,"causes":1531,"problems":1532,"linking":1533,"earlier":1534,"setting":1535,"sidesteps":1536,"target_compile_definitions":1537,"private":1538,"cutlass_enable_dir":1539,"cutlass_enable_direct_cuda_driver_call":1540,"vllm_moe_ext_src":1541,"moe_align_sum_kernels":1542,"topk_softmax_kernels":1543,"moe_wna16":1544,"moe_permute_src":1545,"permute_unpermute_kernels":1546,"moe_permute_unpermute_kernel":1547,"moe_permute_unpermute_op":1548,"vllm_moe_wna16_src":1549,"marlin_moe_archs":1550,"moe_marlin_gen_script":1551,"marlin_moe_wna16":1552,"moe_marlin_gen_script_hash":1553,"moe_marlin_":1554,"rlin_gen_script_hash":1555,"moe_marlin_generation_result":1556,"moe_marlin_generation_output":1557,"moe_marlin_generation":1558,"moe_wnaa16_marlin_src":1559,"vllm_":1560,"vllm_rocm_ext_src":1561,"skinny_gemms":1562,"ship":1563,"projects":1564,"external_projects":1565,"flashmla":1566,"overwrites":1567,"requires_files":1568,"cleaning":1569,"lines":1570,"readlines":1571,"lower":1572,"removed":1573,"done":1574,"conduct":1575,"pledge":1576,"members":1577,"contributors":1578,"leaders":1579,"participation":1580,"harassment":1581,"free":1582,"experience":1583,"everyone":1584,"regardless":1585,"age":1586,"body":1587,"size":1588,"visible":1589,"invisible":1590,"disability":1591,"ethnicity":1592,"sex":1593,"characteristics":1594,"gender":1595,"identity":1596,"education":1597,"socioeconomic":1598,"nationality":1599,"personal":1600,"appearance":1601,"race":1602,"caste":1603,"color":1604,"religion":1605,"sexual":1606,"orientation":1607,"act":1608,"interact":1609,"ways":1610,"contribute":1611,"welcoming":1612,"diverse":1613,"inclusive":1614,"healthy":1615,"standards":1616,"behavior":1617,"contributes":1618,"positive":1619,"demonstrating":1620,"empathy":1621,"kindness":1622,"toward":1623,"people":1624,"being":1625,"respectful":1626,"differing":1627,"opinions":1628,"viewpoints":1629,"experiences":1630,"giving":1631,"gracefully":1632,"accepting":1633,"constructive":1634,"feedback":1635,"responsibility":1636,"apologizing":1637,"those":1638,"affected":1639,"mistakes":1640,"learning":1641,"focusing":1642,"best":1643,"just":1644,"individuals":1645,"overall":1646,"unacceptable":1647,"sexualized":1648,"imagery":1649,"advances":1650,"kind":1651,"trolling":1652,"insulting":1653,"derogatory":1654,"comments":1655,"political":1656,"attacks":1657,"public":1658,"publishing":1659,"others":1660,"information":1661,"physical":1662,"email":1663,"without":1664,"permission":1665,"reasonably":1666,"inappropriate":1667,"professional":1668,"enforcement":1669,"responsibilities":1670,"responsible":1671,"clarifying":1672,"enforcing":1673,"acceptable":1674,"take":1675,"appropriate":1676,"fair":1677,"corrective":1678,"action":1679,"response":1680,"deem":1681,"threatening":1682,"offensive":1683,"harmful":1684,"edit":1685,"reject":1686,"wiki":1687,"edits":1688,"aligned":1689,"reasons":1690,"moderation":1691,"decisions":1692,"scope":1693,"applies":1694,"within":1695,"spaces":1696,"individual":1697,"officially":1698,"representing":1699,"posting":1700,"social":1701,"account":1702,"acting":1703,"appointed":1704,"representative":1705,"online":1706,"offline":1707,"irl":1708,"event":1709,"instances":1710,"abusive":1711,"harassing":1712,"otherwise":1713,"reported":1714,"channel":1715,"complaints":1716,"reviewed":1717,"investigated":1718,"promptly":1719,"fairly":1720,"obligated":1721,"respect":1722,"privacy":1723,"reporter":1724,"incident":1725,"guidelines":1726,"follow":1727,"impact":1728,"determining":1729,"consequences":1730,"violation":1731,"correction":1732,"deemed":1733,"unprofessional":1734,"unwelcome":1735,"consequence":1736,"written":1737,"providing":1738,"clarity":1739,"around":1740,"nature":1741,"explanation":1742,"why":1743,"apology":1744,"requested":1745,"series":1746,"continued":1747,"interaction":1748,"unsolicited":1749,"period":1750,"includes":1751,"avoiding":1752,"interactions":1753,"well":1754,"channels":1755,"violating":1756,"terms":1757,"lead":1758,"permanent":1759,"ban":1760,"serious":1761,"sustained":1762,"communication":1763,"during":1764,"pattern":1765,"aggression":1766,"disparagement":1767,"classes":1768,"attribution":1769,"contributor":1770,"covenant":1771,"www":1772,"code_of_conduct":1773,"inspired":1774,"mozilla":1775,"ladder":1776,"inclusion":1777,"answers":1778,"faq":1779,"translations":1780,"traceback":1781,"typing":1782,"callable":1783,"unittest":1784,"mock":1785,"find_cuda_init":1786,"fn":1787,"object":1788,"helper":1789,"function":1790,"initialization":1791,"errors":1792,"initializes":1793,"prints":1794,"stack":1795,"trace":1796,"happens":1797,"_lazy_init":1798,"nonlocal":1799,"extract_stack":1800,"initialized":1801,"format_list":1802,"__main__":1803,"import_module":1804,"policy":1805,"reporting":1806,"report":1807,"privately":1808,"vulnerability":1809,"submission":1810,"form":1811,"triage":1812,"reports":1813,"triaged":1814,"vulnerability_management":1815,"threat":1816,"guide":1817,"usage":1818,"assumptions":1819,"recommendations":1820,"securely":1821,"severity":1822,"risk":1823,"taking":1824,"dealing":1825,"past":1826,"defaults":1827,"cases":1828,"categories":1829,"vulnerabilities":1830,"allow":1831,"attackers":1832,"execute":1833,"arbitrary":1834,"significantly":1835,"compromise":1836,"confidentiality":1837,"integrity":1838,"availability":1839,"privileges":1840,"needed":1841,"network":1842,"deserialization":1843,"exploit":1844,"chains":1845,"generally":1846,"rated":1847,"cvss":1848,"flaws":1849,"elevated":1850,"rce":1851,"contexts":1852,"significant":1853,"loss":1854,"advanced":1855,"conditions":1856,"trust":1857,"deployment":1858,"modes":1859,"node":1860,"privileged":1861,"scores":1862,"moderate":1863,"cause":1864,"denial":1865,"service":1866,"partial":1867,"disruption":1868,"breach":1869,"rating":1870,"low":1871,"informational":1872,"exploitable":1873,"weaknesses":1874,"privilege":1875,"negligible":1876,"side":1877,"collisions":1878,"often":1879,"less":1880,"prenotification":1881,"prenotify":1882,"vendors":1883,"purpose":1884,"coordinated":1885,"notification":1886,"contacts":1887,"advisory":1888,"few":1889,"added":1890,"send":1891,"vendor":1892,"analyzed":1893,"case":1894,"withdraw":1895,"receiving":1896,"prenotifications":1897,"membership":1898,"refinements":1899,"who":1900,"mkdocs":1901,"autonav":1902,"material":1903,"mkdocstrings":1904,"gen":1905,"awesome":1906,"nav":1907,"glightbox":1908,"localized":1909,"plugin":1910,"minify":1911,"markdown":1912,"math":1913,"regex":1914,"ruff":1915,"argparse":1916,"hook":1917,"cachetools":1918,"cbor2":1919,"cloudpickle":1920,"fastapi":1921,"msgspec":1922,"harmony":1923,"parser":1924,"pillow":1925,"psutil":1926,"pybase64":1927,"pydantic":1928,"setproctitle":1929,"transformers":1930,"zmq":1931,"uvloop":1932,"prometheus":1933,"client":1934,"numba":1935,"60":1936,"python_version":1937,"61":1938,"gram":1939,"botocore":1940,"ray":1941,"45":1942,"peft":1943,"pytest":1944,"asyncio":1945,"24":1946,"77":1947,"80":1948,"scm":1949,"conch":1950,"triton":1951,"jinja2":1952,"78":1953,"nixl":1954,"torch_xla":1955,"pre":1956,"extra":1957,"links":1958,"storage":1959,"googleapis":1960,"libtpu":1961,"jax":1962,"jax_nightly_releases":1963,"jaxlib_nightly_releases":1964,"dev20250730":1965,"torchvision":1966,"pallas":1967,"xla":1968,"tpuvm":1969,"cp311":1970,"linux_x86_64":1971,"cp312":1972,"platform_machine":1973,"x86_64":1974,"x86":1975,"pull":1976,"151218":1977,"platform_system":1978,"ppc64le":1979,"aarch64":1980,"arm64":1981,"17960":1982,"image":1983,"processor":1984,"minicpm":1985,"2_6":1986,"alongside":1987,"torchaudio":1988,"s390x":1989,"phi3v":1990,"openmp":1991,"2024":1992,"intel_extension_for_pytorch":1993,"imported":1994,"gather":1995,"optimize":1996,"arm":1997,"neoverse":1998,"cores":1999,"cpuinfo":2000,"formatting":2001,"autogenerated":2002,"uv":2003,"strategy":2004,"unsafe":2005,"cu128":2006,"absl":2007,"rouge":2008,"score":2009,"accelerate":2010,"lm":2011,"eval":2012,"aenum":2013,"lightly":2014,"affine":2015,"rasterio":2016,"aiohappyeyeballs":2017,"aiohttp":2018,"cors":2019,"fsspec":2020,"aiosignal":2021,"albucore":2022,"terratorch":2023,"albumentations":2024,"alembic":2025,"mlflow":2026,"annotated":2027,"antlr4":2028,"hydra":2029,"omegaconf":2030,"anyio":2031,"httpx":2032,"starlette":2033,"argcomplete":2034,"datamodel":2035,"generator":2036,"arrow":2037,"isoduration":2038,"attrs":2039,"fiona":2040,"hypothesis":2041,"jsonlines":2042,"jsonschema":2043,"subtests":2044,"referencing":2045,"audioread":2046,"backoff":2047,"schemathesis":2048,"bitsandbytes":2049,"46":2050,"lightning":2051,"black":2052,"blinker":2053,"flask":2054,"blobfile":2055,"bm25s":2056,"mteb":2057,"35":2058,"57":2059,"s3transfer":2060,"bounded":2061,"pool":2062,"executor":2063,"pqdm":2064,"buildkite":2065,"collector":2066,"auth":2067,"skinny":2068,"certifi":2069,"30":2070,"httpcore":2071,"pyogrio":2072,"pyproj":2073,"cffi":2074,"chardet":2075,"mbstrdecoder":2076,"charset":2077,"normalizer":2078,"click":2079,"plugins":2080,"cligj":2081,"jiwer":2082,"nltk":2083,"typer":2084,"uvicorn":2085,"colorama":2086,"sacrebleu":2087,"tqdm":2088,"multiprocess":2089,"colorful":2090,"contourpy":2091,"matplotlib":2092,"cramjam":2093,"fastparquet":2094,"cupy":2095,"cuda12x":2096,"cycler":2097,"sdk":2098,"59":2099,"dataproperty":2100,"pytablewriter":2101,"tabledata":2102,"evaluate":2103,"decorator":2104,"dill":2105,"distlib":2106,"virtualenv":2107,"dnspython":2108,"validator":2109,"docopt":2110,"num2words":2111,"docstring":2112,"jsonargparse":2113,"efficientnet":2114,"segmentation":2115,"einops":2116,"encodec":2117,"torchgeo":2118,"vector":2119,"quantize":2120,"vocos":2121,"einx":2122,"backport":2123,"116":2124,"genai":2125,"perf":2126,"fastrlock":2127,"fastsaf":2128,"pe":2129,"filelock":2130,"hub":2131,"fonttools":2132,"55":2133,"fqdn":2134,"frozendict":2135,"frozenlist":2136,"ftfy":2137,"clip":2138,"genson":2139,"geopandas":2140,"gitdb":2141,"gitpython":2142,"44":2143,"opencensus":2144,"40":2145,"protos":2146,"70":2147,"graphene":2148,"graphql":2149,"relay":2150,"greenlet":2151,"sqlalchemy":2152,"grpcio":2153,"71":2154,"gunicorn":2155,"h11":2156,"h5py":2157,"harfile":2158,"hf":2159,"xet":2160,"hiredis":2161,"27":2162,"34":2163,"sentence":2164,"emathesis":2165,"timm":2166,"tokenizers":2167,"humanize":2168,"131":2169,"idna":2170,"yarl":2171,"imageio":2172,"37":2173,"scikit":2174,"opentelemetry":2175,"typeshed":2176,"inflect":2177,"iniconfig":2178,"isort":2179,"itsdangerous":2180,"jmespath":2181,"joblib":2182,"jsonpointer":2183,"specifications":2184,"junit":2185,"xml":2186,"kaleido":2187,"kiwisolver":2188,"kornia":2189,"rs":2190,"lazy":2191,"libnacl":2192,"post0":2193,"utilities":2194,"torchmetrics":2195,"llvmlite":2196,"lxml":2197,"mako":2198,"rich":2199,"markupsafe":2200,"werkzeug":2201,"pycocotools":2202,"typepy":2203,"mdurl":2204,"itertools":2205,"mpmath":2206,"sympy":2207,"msgpack":2208,"38":2209,"multidict":2210,"munch":2211,"pretrainedmodels":2212,"mypy":2213,"networkx":2214,"numexpr":2215,"numpy":2216,"opencv":2217,"headless":2218,"patsy":2219,"rioxarray":2220,"scipy":2221,"shapely":2222,"soxr":2223,"statsmodels":2224,"tensorboardx":2225,"tifffile":2226,"tritonclient":2227,"xarray":2228,"cublas":2229,"cu12":2230,"cudnn":2231,"cusolver":2232,"cupti":2233,"nvrtc":2234,"cufft":2235,"41":2236,"cufile":2237,"curand":2238,"cusparse":2239,"53":2240,"cusparselt":2241,"nccl":2242,"nvjitlink":2243,"nvtx":2244,"32":2245,"86":2246,"exporter":2247,"semantic":2248,"conventions":2249,"56b0":2250,"proto":2251,"36":2252,"plotly":2253,"pooch":2254,"rerunfailures":2255,"pathspec":2256,"pathvalidate":2257,"platformdirs":2258,"pluggy":2259,"polars":2260,"29":2261,"portalocker":2262,"propcache":2263,"plus":2264,"protobuf":2265,"28":2266,"forked":2267,"spy":2268,"pyarrow":2269,"pyasn1":2270,"rsa":2271,"pybind11":2272,"pycountry":2273,"pycparser":2274,"pycryptodomex":2275,"33":2276,"pygments":2277,"pyparsing":2278,"pyrate":2279,"limiter":2280,"pystemmer":2281,"shard":2282,"timeout":2283,"box":2284,"dateutil":2285,"rapidjson":2286,"pytrec":2287,"terrier":2288,"pytz":2289,"pyyaml":2290,"responses":2291,"rapidfuzz":2292,"ri":2293,"48":2294,"redis":2295,"tiktoken":2296,"testclient":2297,"25":2298,"rfc3339":2299,"rfc3987":2300,"rpds":2301,"rtree":2302,"safetensors":2303,"39":2304,"sentencepiece":2305,"shellingham":2306,"six":2307,"smart":2308,"smmap":2309,"sniffio":2310,"sortedcontainers":2311,"sqlitedict":2312,"sqlparse":2313,"tabulate":2314,"tcolorpy":2315,"tenacity":2316,"1rc2":2317,"threadpoolctl":2318,"tomli":2319,"66":2320,"transfo":2321,"stream":2322,"51":2323,"20241206":2324,"inspection":2325,"tzdata":2326,"uri":2327,"urllib3":2328,"31":2329,"wcwidth":2330,"webcolors":2331,"word2number":2332,"wrapt":2333,"xxhash":2334,"zipp":2335,"zstandard":2336,"devices":2337,"neuronx":2338,"cc":2339,"0a0":2340,"multimodal":2341,"preprocessing":2342,"mirrored":2343,"temporarily":2344,"lint":2345,"modify":2346,"two":2347,"referenced":2348,"phi4mm":2349,"kimi":2350,"vl":2351,"mpt":2352,"qwen":2353,"tests":2354,"minicpmo_26":2355,"cgraph":2356,"internvl":2357,"transformers_stream_generator":2358,"voxtral":2359,"smolvlm":2360,"datamodel_code_generator":2361,"minicpm3":2362,"evaluation":2363,"52":2364,"schema":2365,"genai_perf":2366,"leads":2367,"entrypoints":2368,"pycparse":2369,"test_video":2370,"decord":2371,"test_score":2372,"basic":2373,"extended":2374,"v1":2375,"vision":2376,"tab":2377,"readme":2378,"ov":2379,"facebookresearch":2380,"xformers":2381,"higher":2382,"matching":2383,"tokenizer":2384,"blake3":2385,"incremental":2386,"detokenization":2387,"llamatokenizer":2388,"115":2389,"transcriptions":2390,"endpoint":2391,"99":2392,"reasoning":2393,"prometheus_client":2394,"instrumentator":2395,"dbrx":2396,"enforcer":2397,"llguidance":2398,"outlines_core":2399,"outlines":2400,"disk":2401,"diskcache":2402,"lark":2403,"xgrammar":2404,"typing_extensions":2405,"tox":2406,"317":2407,"parsing":2408,"pyzmq":2409,"importlib_metadata":2410,"io":2411,"transitive":2412,"needs":2413,"modern":2414,"distutils":2415,"qwen2":2416,"compressed":2417,"tensors":2418,"depyf":2419,"profiling":2420,"debugging":2421,"config":2422,"pickling":2423,"registry":2424,"watchfiles":2425,"ired":2426,"http":2427,"updates":2428,"tls":2429,"logging_configuration":2430,"phi":2431,"instruct":2432,"base64":2433,"implementation":2434,"cross":2435,"serialization":2436,"hashable":2437,"objects":2438,"better":2439,"monitoring":2440,"gpt":2441,"oss":2442,"lmcache":2443,"rocm6":2444,"amdsmi":2445,"doctype":2446,"h1":2447,"href":2448,"wheel_html_escaped":2449,"br":2450,"argumentparser":2451,"add_argument":2452,"help":2453,"args":2454,"parse_args":2455,"cloudfront":2456,"escaping":2457,"character":2458,"2b":2459,"vllm_max_size_mb":2460,"defaulting":2461,"400":2462,"mib":2463,"quota":2464,"wisely":2465,"3792":2466,"print_top_10_largest_files":2467,"zip_file":2468,"top":2469,"largest":2470,"zip":2471,"file_sizes":2472,"getinfo":2473,"file_size":2474,"namelist":2475,"reverse":2476,"1024":2477,"2f":2478,"mbs":2479,"uncompressed":2480,"check_wheel_size":2481,"walk":2482,"file_name":2483,"endswith":2484,"wheel_size_mb":2485,"getsize":2486,"larger":2487,"mb":2488,"limit":2489,"harness":2490,"baseline":2491,"computed":2492,"yaml":2493,"test_lm_eval_correctness":2494,"small":2495,"tp":2496,"lm_eval":2497,"np":2498,"rtol":2499,"08":2500,"launch_lm_eval":2501,"eval_config":2502,"tp_size":2503,"trust_remote_code":2504,"max_model_len":2505,"4096":2506,"model_args":2507,"pretrained":2508,"model_name":2509,"tensor_parallel_size":2510,"enforce_eager":2511,"add_bos_token":2512,"simple_evaluate":2513,"tasks":2514,"task":2515,"num_fewshot":2516,"batch_size":2517,"auto":2518,"test_lm_eval_correctness_param":2519,"config_filename":2520,"safe_load":2521,"read_text":2522,"encoding":2523,"success":2524,"metric":2525,"metrics":2526,"ground_truth":2527,"measured_value":2528,"measured":2529,"isclose":2530,"pytest_addoption":2531,"addoption":2532,"store":2533,"listing":2534,"yamls":2535,"fixture":2536,"session":2537,"config_list_file":2538,"pytestconfig":2539,"config_dir":2540,"rel_path":2541,"getoption":2542,"pytest_generate_tests":2543,"metafunc":2544,"fixturenames":2545,"resolve":2546,"parametrize":2547,"meta":2548,"70b":2549,"fbgemm":2550,"nonuniform":2551,"8x7b":2552,"57b":2553,"a14":2554,"lite":2555,"chat":2556,"8b":2557,"5b":2558,"1b":2559,"asym":2560,"3b":2561,"dynamic":2562,"qwen1":2563,"suite":2564,"introduction":2565,"workload":2566,"developers":2567,"gain":2568,"whether":2569,"improves":2570,"degrades":2571,"alternatives":2572,"tgi":2573,"trt":2574,"lmdeploy":2575,"choose":2576,"quick":2577,"overview":2578,"benchmarking":2579,"latency":2580,"fix":2581,"qps":2582,"a100":2583,"coming":2584,"xeon":2585,"processors":2586,"different":2587,"duration":2588,"1hr":2589,"constraint":2590,"hr":2591,"won":2592,"forever":2593,"engines":2594,"5hrs":2595,"label":2596,"ready":2597,"sh":2598,"on_cpu":2599,"serving_json":2600,"latency_json":2601,"throughput_json":2602,"throughout":2603,"remote_host":2604,"ip":2605,"remote_port":2606,"port":2607,"descriptions":2608,"detailed":2609,"inside":2610,"test_name":2611,"latency_llama8b_tp1":2612,"parameters":2613,"load_format":2614,"dummy":2615,"num_iters_warmup":2616,"num_iters":2617,"attributes":2618,"unique":2619,"identifier":2620,"latency_":2621,"attribute":2622,"arguments":2623,"underline":2624,"dash":2625,"specifying":2626,"convert":2627,"feeding":2628,"load":2629,"num":2630,"iters":2631,"warmup":2632,"numbers":2633,"highly":2634,"sensitive":2635,"save":2636,"itself":2637,"parameter":2638,"syntax":2639,"fed":2640,"slight":2641,"vary":2642,"rate":2643,"inf":2644,"cover":2645,"overhead":2646,"serving_llama8b_tp1_sharegpt":2647,"qps_list":2648,"server_parameters":2649,"swap_space":2650,"disable_log_stats":2651,"client_parameters":2652,"dataset_name":2653,"sharegpt":2654,"dataset_path":2655,"sharegpt_v3_unfiltered_cleaned_split":2656,"num_prompts":2657,"serving_":2658,"controls":2659,"compared":2660,"delay":2661,"randomized":2662,"dataset":2663,"benchmark_serving":2664,"still":2665,"greatly":2666,"saving":2667,"related":2668,"visualizing":2669,"helps":2670,"put":2671,"table":2672,"presented":2673,"job":2674,"page":2675,"wait":2676,"till":2677,"finish":2678,"attached":2679,"raw":2680,"converted":2681,"folder":2682,"along":2683,"benchmark_results":2684,"compares":2685,"provides":2686,"ratio":2687,"tput":2688,"median":2689,"ttft":2690,"tpot":2691,"passed":2692,"pp":2693,"result_a":2694,"result_b":2695,"lenght":2696,"concurrency":2697,"results_a":2698,"results_b":2699,"perf_ratio":2700,"random":2701,"128":2702,"1000":2703,"142":2704,"633982":2705,"156":2706,"526018":2707,"097396":2708,"241":2709,"620334":2710,"294":2711,"018783":2712,"216863":2713,"diagram":2714,"96c":2715,"results_gnr_96c_091_tp2pp3":2716,"128c":2717,"results_gnr_128c_091_tp2pp3":2718,"img":2719,"width":2720,"1886":2721,"height":2722,"828":2723,"alt":2724,"user":2725,"attachments":2726,"c02a43ef":2727,"25d0":2728,"4fd6":2729,"90e5":2730,"2169a28682dd":2731,"description":2732,"containers":2733,"specifies":2734,"container":2735,"probe":2736,"engine":2737,"described":2738,"launch":2739,"summary":2740,"collect":2741,"plot":2742,"commands":2743,"hard":2744,"coded":2745,"several":2746,"populating":2747,"updating":2748,"tensorrt":2749,"demo":2750,"neuralmagic":2751,"aims":2752,"provide":2753,"sglang":2754,"reproducible":2755,"reproducing":2756,"instructions":2757,"09":2758,"05":2759,"scroll":2760,"reproduction":2761,"guilde":2762,"8176":2763,"images":2764,"lmsysorg":2765,"cu121":2766,"openmmlab":2767,"nvcr":2768,"tritonserver":2769,"07":2770,"trtllm":2771,"py3":2772,"r24":2773,"going":2774,"bump":2775,"concrete":2776,"specs":2777,"8x":2778,"heavy":2779,"average":2780,"462":2781,"tokens":2782,"256":2783,"2105":2784,"second":2785,"queries":2786,"randomly":2787,"sampled":2788,"arrival":2789,"patterns":2790,"determined":2791,"poisson":2792,"fixed":2793,"seed":2794,"token":2795,"itl":2796,"inter":2797,"known":2798,"ignore":2799,"eos":2800,"flag":2801,"annotation":2802,"artifact":2803,"visualization":2804,"deploy":2805,"export":2806,"hf_token":2807,"apt":2808,"unzip":2809,"vllm_source_code_loc":2810,"length":2811,"batch":2812,"mean":2813,"p99":2814,"latency_tests_markdown_table":2815,"sample":2816,"prompts":2817,"dynamically":2818,"achieve":2819,"maximum":2820,"throughput_tests_markdown_table":2821,"means":2822,"come":2823,"values":2824,"100":2825,"serving_tests_markdown_table":2826,"platform_markdown_table":2827,"tables":2828,"section":2829,"dataframes":2830,"follows":2831,"pd":2832,"benchmarking_results_json":2833,"benchmarking_results":2834,"latency_results":2835,"dataframe":2836,"from_dict":2837,"throughput_results":2838,"serving_results":2839,"benchmarking_results_in_json_string":2840,"experiment":2841,"parse_arguments":2842,"get_perf":2843,"df":2844,"method":2845,"qps_":2846,"filtered_df":2847,"array":2848,"get_perf_w_std":2849,"ms":2850,"tolist":2851,"std":2852,"successful":2853,"sqrt":2854,"tok":2855,"results_folder":2856,"test_file":2857,"_nightly_results":2858,"md_table":2859,"headers":2860,"keys":2861,"tablefmt":2862,"pipe":2863,"showindex":2864,"nightly_results_benchmarking_table":2865,"nightly_results":2866,"api_client":2867,"apiclient":2868,"localhost":2869,"8000":2870,"available_models":2871,"split_json_by_tp_pp":2872,"input_file":2873,"output_root":2874,"separate":2875,"folders":2876,"creates":2877,"_pp":2878,"paths":2879,"isinstance":2880,"break":2881,"handle":2882,"alias":2883,"column":2884,"rename_map":2885,"pp_size":2886,"pipeline_parallel_size":2887,"rename":2888,"columns":2889,"inplace":2890,"numeric":2891,"ints":2892,"nan":2893,"to_numeric":2894,"coerce":2895,"fillna":2896,"astype":2897,"saved_paths":2898,"group_df":2899,"groupby":2900,"dropna":2901,"folder_name":2902,"filepath":2903,"to_json":2904,"orient":2905,"records":2906,"indent":2907,"force_ascii":2908,"saved":2909,"store_true":2910,"booleanoptionalaction":2911,"diagrams":2912,"xaxis":2913,"axis":2914,"comparision":2915,"drop_column":2916,"name_column":2917,"info_cols":2918,"data_cols_to_compare":2919,"html_msgs_for_data_cols":2920,"splits":2921,"comparing":2922,"assign":2923,"y_axis_index":2924,"perf_comparison":2925,"text_file":2926,"output_df":2927,"raw_data_cols":2928,"compare_data_columns":2929,"insert":2930,"filtered_info_cols":2931,"existing_group_cols":2932,"valid":2933,"subset":2934,"output_df_sorted":2935,"sort_values":2936,"output_groups":2937,"to_html":2938,"express":2939,"px":2940,"df_sorted":2941,"melt":2942,"plotting":2943,"df_melted":2944,"id_vars":2945,"var_name":2946,"value_name":2947,"chart":2948,"fig":2949,"markers":2950,"full_html":2951,"include_plotlyjs":2952,"cdn":2953,"data_column":2954,"ncompare_data_column":2955,"frames":2956,"compare_frames":2957,"data_df":2958,"read_json":2959,"serving_df":2960,"ignore_index":2961,"couple":2962,"col":2963,"mode":2964,"_name":2965,"among":2966,"ratio_df":2967,"pop":2968,"concat_df":2969,"concat":2970,"datetime":2971,"printed":2972,"serving_column_mapping":2973,"gpu_type":2974,"request_throughput":2975,"mean_ttft_ms":2976,"std_ttft_ms":2977,"median_ttft_ms":2978,"mean_itl_ms":2979,"std_itl_ms":2980,"median_itl_ms":2981,"mean_tpot_ms":2982,"std_tpot_ms":2983,"median_tpot_ms":2984,"total_token_throughput":2985,"total":2986,"output_throughput":2987,"total_input_tokens":2988,"total_output_tokens":2989,"raw_result":2990,"attach":2991,"with_suffix":2992,"stem":2993,"serving_md_table_with_headers":2994,"serving_md_table_lines":2995,"serving_md_table_without_header":2996,"now":2997,"strftime":2998,"d_":2999,"current_llm_serving_engine":3000,"document":3001,"wants":3002,"reproduce":3003,"to_dict":3004,"dumps":3005,"spdx":3006,"license":3007,"apache":3008,"filecopyrighttext":3009,"copyright":3010,"shlex":3011,"latency_column_mapping":3012,"avg_latency":3013,"p10":3014,"p25":3015,"p50":3016,"p75":3017,"p90":3018,"throughput_results_column_mapping":3019,"num_requests":3020,"total_num_tokens":3021,"elapsed_time":3022,"elapsed":3023,"requests_per_second":3024,"tokens_per_second":3025,"model_id":3026,"input_len":3027,"output_len":3028,"dtype":3029,"max_concurrency":3030,"p99_ttft_ms":3031,"p99_tpot_ms":3032,"t_ms":3033,"p99_itl_ms":3034,"read_markdown":3035,"results_to_json":3036,"get_size_with_unit":3037,"bytes":3038,"suffix":3039,"scale":3040,"1253656":3041,"20mb":3042,"1253656678":3043,"17gb":3044,"factor":3045,"unit":3046,"_coerce":3047,"val":3048,"effort":3049,"coercion":3050,"null":3051,"integers":3052,"fullmatch":3053,"floats":3054,"strings":3055,"float":3056,"parse_client_command":3057,"cmd":3058,"client_command":3059,"toks":3060,"while":3061,"boolean":3062,"consume":3063,"next":3064,"pair":3065,"lone":3066,"unexpected":3067,"positional":3068,"turn":3069,"filenotfounderror":3070,"arg":3071,"server_command":3072,"col_mapping":3073,"enumerate":3074,"percentiles":3075,"perc":3076,"50":3077,"75":3078,"90":3079,"multiply":3080,"w_result":3081,"svmem":3082,"virtual_memory":3083,"platform_data":3084,"logical":3085,"find_spec":3086,"numa":3087,"nodes":3088,"get_num_configured_nodes":3089,"get_cpu_info":3090,"brand":3091,"brand_raw":3092,"platform_results":3093,"raw_results_json":3094,"remapping":3095,"valid_columns":3096,"processed_results_json":3097,"respective":3098,"sometimes":3099,"gputype":3100,"ngputype":3101,"8xgputype":3102,"latency_md_table":3103,"serving_md_table":3104,"throughput_md_table":3105,"platform_md_table":3106,"md_file":3107,"json_file":3108,"descri":3109,"autotokenizer":3110,"cachedir":3111,"from_pretrained":3112,"save_pretrained":3113,"samplingparams":3114,